namespace Astro
{
    class SlavAstronomy
    {
        public static string DayCalc(int abb10, int cac1, int cac2)
        {
            string[] zz;
            if (abb10 == 1 || abb10 == 10 || abb10 == 20 || abb10 == 29 || abb10 == 39 || abb10 == 48 || abb10 == 49 || abb10 == 58 || abb10 == 68 || abb10 == 77 || abb10 == 87 || abb10 == 96 || abb10 == 97 || abb10 == 106 || abb10 == 116 || abb10 == 125 || abb10 == 135 || abb10 == 144)
            {
                zz = new string[9] { "Понедельникъ", "Вторникъ", "Тритейникъ", "Четверикъ", "Пятница", "Шестица", "Седьмица", "Осьмица", "Неделя" };
            }
            else if (abb10 == 3 || abb10 == 12 || abb10 == 22 || abb10 == 31 || abb10 == 41 || abb10 == 51 || abb10 == 60 || abb10 == 70 || abb10 == 79 || abb10 == 89 || abb10 == 99 || abb10 == 108 || abb10 == 118 || abb10 == 127 || abb10 == 137)
            {
                zz = new string[9] { "Вторникъ", "Тритейникъ", "Четверикъ", "Пятница", "Шестица", "Седьмица", "Осьмица", "Неделя", "Понедельникъ" };
            }
            else if (abb10 == 5 || abb10 == 14 || abb10 == 24 || abb10 == 34 || abb10 == 43 || abb10 == 53 || abb10 == 62 || abb10 == 72 || abb10 == 82 || abb10 == 91 || abb10 == 101 || abb10 == 110 || abb10 == 120 || abb10 == 130 || abb10 == 139)
            {
                zz = new string[9] { "Тритейникъ", "Четверикъ", "Пятница", "Шестица", "Седьмица", "Осьмица", "Неделя", "Понедельникъ", "Вторникъ" };
            }
            else if (abb10 == 7 || abb10 == 16 || abb10 == 17 || abb10 == 26 || abb10 == 36 || abb10 == 45 || abb10 == 55 || abb10 == 64 || abb10 == 65 || abb10 == 74 || abb10 == 84 || abb10 == 93 || abb10 == 103 || abb10 == 112 || abb10 == 113 || abb10 == 122 || abb10 == 132 || abb10 == 141)
            {
                zz = new string[9] { "Четверикъ", "Пятница", "Шестица", "Седьмица", "Осьмица", "Неделя", "Понедельникъ", "Вторникъ", "Тритейникъ" };
            }
            else if (abb10 == 9 || abb10 == 19 || abb10 == 28 || abb10 == 38 || abb10 == 47 || abb10 == 57 || abb10 == 67 || abb10 == 76 || abb10 == 86 || abb10 == 95 || abb10 == 105 || abb10 == 115 || abb10 == 124 || abb10 == 134 || abb10 == 143)
            {
                zz = new string[9] { "Пятница", "Шестица", "Седьмица", "Осьмица", "Неделя", "Понедельникъ", "Вторникъ", "Тритейникъ", "Четверикъ" };
            }
            else if (abb10 == 2 || abb10 == 11 || abb10 == 21 || abb10 == 30 || abb10 == 40 || abb10 == 50 || abb10 == 59 || abb10 == 69 || abb10 == 78 || abb10 == 88 || abb10 == 98 || abb10 == 107 || abb10 == 117 || abb10 == 126 || abb10 == 136)
            {
                zz = new string[9] { "Шестица", "Седьмица", "Осьмица", "Неделя", "Понедельникъ", "Вторникъ", "Тритейникъ", "Четверикъ", "Пятница" };
            }
            else if (abb10 == 4 || abb10 == 13 || abb10 == 23 || abb10 == 32 || abb10 == 33 || abb10 == 42 || abb10 == 52 || abb10 == 61 || abb10 == 71 || abb10 == 80 || abb10 == 81 || abb10 == 90 || abb10 == 100 || abb10 == 109 || abb10 == 119 || abb10 == 128 || abb10 == 129 || abb10 == 138)
            {
                zz = new string[9] { "Седьмица", "Осьмица", "Неделя", "Понедельникъ", "Вторникъ", "Тритейникъ", "Четверикъ", "Пятница", "Шестица" };
            }
            else if (abb10 == 6 || abb10 == 15 || abb10 == 25 || abb10 == 35 || abb10 == 44 || abb10 == 54 || abb10 == 63 || abb10 == 73 || abb10 == 83 || abb10 == 92 || abb10 == 102 || abb10 == 111 || abb10 == 121 || abb10 == 131 || abb10 == 140)
            {
                zz = new string[9] { "Осьмица", "Неделя", "Понедельникъ", "Вторникъ", "Тритейникъ", "Четверикъ", "Пятница", "Шестица", "Седьмица" };
            }
            else
            {
                zz = new string[9] { "Неделя", "Понедельникъ", "Вторникъ", "Тритейникъ", "Четверикъ", "Пятница", "Шестица", "Седьмица", "Осьмица" };
            }
            int az;
            if (cac1 == 1)
            {
                az = ((cac2 + 9) % 9) - 1;
            }
            else if (cac1 == 2)
            {
                az = ((cac2 + 41) % 9) - 1;
            }
            else if (cac1 == 3)
            {
                az = ((cac2 + 41 + 40) % 9) - 1;
            }
            else if (cac1 == 4)
            {
                az = ((cac2 + 41 + 40 + 41) % 9) - 1;
            }
            else if (cac1 == 5)
            {
                az = ((cac2 + 41 + 40 + 41 + 40) % 9) - 1;
            }
            else if (cac1 == 6)
            {
                az = ((cac2 + 41 + 40 + 41 + 40 + 41) % 9) - 1;
            }
            else if (cac1 == 7)
            {
                az = ((cac2 + 41 + 40 + 41 + 40 + 41 + 40) % 9) - 1;
            }
            else if (cac1 == 8)
            {
                az = ((cac2 + 41 + 40 + 41 + 40 + 41 + 40 + 41) % 9) - 1;
            }
            else
            {
                az = ((cac2 + 41 + 40 + 41 + 40 + 41 + 40 + 41 + 40) % 9) - 1;
            }
            if ((abb10 == 128 || abb10 == 112 || abb10 == 96 || abb10 == 80 || abb10 == 64 || abb10 == 48 || abb10 == 32 || abb10 == 16 || abb10 == 144) && cac1 == 1)
            {
                az = ((cac2 + 9) % 9) - 1;
            }
            else if ((abb10 == 128 || abb10 == 112 || abb10 == 96 || abb10 == 80 || abb10 == 64 || abb10 == 48 || abb10 == 32 || abb10 == 16 || abb10 == 144) && cac1 == 2)
            {
                az = ((cac2 + 41) % 9) - 1;
            }
            else if ((abb10 == 128 || abb10 == 112 || abb10 == 96 || abb10 == 80 || abb10 == 64 || abb10 == 48 || abb10 == 32 || abb10 == 16 || abb10 == 144) && cac1 == 3)
            {
                az = ((cac2 + 41 + 41) % 9) - 1;
            }
            else if ((abb10 == 128 || abb10 == 112 || abb10 == 96 || abb10 == 80 || abb10 == 64 || abb10 == 48 || abb10 == 32 || abb10 == 16 || abb10 == 144) && cac1 == 4)
            {
                az = ((cac2 + 41 + 41 + 41) % 9) - 1;
            }
            else if ((abb10 == 128 || abb10 == 112 || abb10 == 96 || abb10 == 80 || abb10 == 64 || abb10 == 48 || abb10 == 32 || abb10 == 16 || abb10 == 144) && cac1 == 5)
            {
                az = ((cac2 + 41 + 41 + 41 + 41) % 9) - 1;
            }
            else if ((abb10 == 128 || abb10 == 112 || abb10 == 96 || abb10 == 80 || abb10 == 64 || abb10 == 48 || abb10 == 32 || abb10 == 16 || abb10 == 144) && cac1 == 6)
            {
                az = ((cac2 + 41 + 41 + 41 + 41 + 41) % 9) - 1;
            }
            else if ((abb10 == 128 || abb10 == 112 || abb10 == 96 || abb10 == 80 || abb10 == 64 || abb10 == 48 || abb10 == 32 || abb10 == 16 || abb10 == 144) && cac1 == 7)
            {
                az = ((cac2 + 41 + 41 + 41 + 41 + 41 + 41) % 9) - 1;
            }
            else if ((abb10 == 128 || abb10 == 112 || abb10 == 96 || abb10 == 80 || abb10 == 64 || abb10 == 48 || abb10 == 32 || abb10 == 16 || abb10 == 144) && cac1 == 8)
            {
                az = ((cac2 + 41 + 41 + 41 + 41 + 41 + 41 + 41) % 9) - 1;
            }
            else if ((abb10 == 128 || abb10 == 112 || abb10 == 96 || abb10 == 80 || abb10 == 64 || abb10 == 48 || abb10 == 32 || abb10 == 16 || abb10 == 144) && cac1 == 9)
            {
                az = ((cac2 + 41 + 41 + 41 + 41 + 41 + 41 + 41 + 41) % 9) - 1;
            }

            if (az == (-1)) az = 8;

            return zz[az];
        }

        public static string[] DateConvert(int abbb, int bmonth, int bday, int dIyear)
        {
            const int SIZE = 5;
            string[] ac = new string[SIZE];
            string[] ac1 = new string[SIZE] { "Рамхатъ", "1", "1", "Оусень", "Новолетие. Рамха-Ита. Осень. Осеннее равноденствие. В праздник Новолетия, с каждым ударом Большого колокола, человеку дается возможность избавиться от одного греха (Большой колокол бьет в этот праздник ровно 108 раз), и в течении первого месяца Нового Лета человек, совершивший неблаговидные поступки, должен исправить сложившееся положение. Устраивается пир-братчина, пьется медовая Сурья. Некоторые Рода отмечали Новолетие на Коляду или Красногор." };
            string[] ac2 = new string[SIZE] { "Рамхатъ", "1", "2", "Оусень", "" };
            string[] ac3 = new string[SIZE] { "Рамхатъ", "1", "3", "Оусень", "" };
            string[] ac4 = new string[SIZE] { "Рамхатъ", "1", "4", "Оусень", "День Ивана Омийского." };
            string[] ac5 = new string[SIZE] { "Рамхатъ", "1", "5", "Оусень", "" };
            string[] ac6 = new string[SIZE] { "Рамхатъ", "1", "6", "Оусень", "Праздник Урожая." };
            string[] ac7 = new string[SIZE] { "Рамхатъ", "1", "7", "Оусень", "" };
            string[] ac8 = new string[SIZE] { "Рамхатъ", "1", "8", "Оусень", "" };
            string[] ac9 = new string[SIZE] { "Рамхатъ", "1", "9", "Оусень", "День Сергия Странника." };
            string[] ac10 = new string[SIZE] { "Рамхатъ", "1", "10", "Оусень", "" };
            string[] ac11 = new string[SIZE] { "Рамхатъ", "1", "11", "Оусень", "День Ольги Премудрой." };
            string[] ac12 = new string[SIZE] { "Рамхатъ", "1", "12", "Оусень", "" };
            string[] ac13 = new string[SIZE] { "Рамхатъ", "1", "13", "Оусень", "" };
            string[] ac14 = new string[SIZE] { "Рамхатъ", "1", "14", "Оусень", "День Великой Рассении. Рассения - территория, по которой расселялись Рода Свята Расы." };
            string[] ac15 = new string[SIZE] { "Рамхатъ", "1", "15", "Оусень", "" };
            string[] ac16 = new string[SIZE] { "Рамхатъ", "1", "16", "Оусень", "День Василия Буслаева." };
            string[] ac17 = new string[SIZE] { "Рамхатъ", "1", "17", "Оусень", "" };
            string[] ac18 = new string[SIZE] { "Рамхатъ", "1", "18", "Оусень", "" };
            string[] ac19 = new string[SIZE] { "Рамхатъ", "1", "19", "Оусень", "День Хария Мудрого." };
            string[] ac20 = new string[SIZE] { "Рамхатъ", "1", "20", "Оусень", "" };
            string[] ac21 = new string[SIZE] { "Рамхатъ", "1", "21", "Оусень", "" };
            string[] ac22 = new string[SIZE] { "Рамхатъ", "1", "22", "Оусень", "День Великого Знания. День Вед." };
            string[] ac23 = new string[SIZE] { "Рамхатъ", "1", "23", "Оусень", "Начало Святого Поста (9 дней). В этот период непозволительно употреблять мясную, рыбную, жирную белковую (яйца, масло, молоко) и острую пищу. В пищу в эти дни нужно употреблять: утром и вечером - овощи, фрукты, зерновые и зернобобовые, а днем - воду, соки, травяные чаи. Это связано с подготовкой к переходу на раннеконсервируемую пищу." };
            string[] ac24 = new string[SIZE] { "Рамхатъ", "1", "24", "Оусень", "День Трояна. Данный Бог - Покровитель жизненных путей. Идет Святый Пост." };
            string[] ac25 = new string[SIZE] { "Рамхатъ", "1", "25", "Оусень", "Идет Святый Пост." };
            string[] ac26 = new string[SIZE] { "Рамхатъ", "1", "26", "Оусень", "Идет Святый Пост." };
            string[] ac27 = new string[SIZE] { "Рамхатъ", "1", "27", "Оусень", "День Святибора. Идет Святый Пост." };
            string[] ac28 = new string[SIZE] { "Рамхатъ", "1", "28", "Оусень", "Идет Святый Пост." };
            string[] ac29 = new string[SIZE] { "Рамхатъ", "1", "29", "Оусень", "Идет Святый Пост." };
            string[] ac30 = new string[SIZE] { "Рамхатъ", "1", "30", "Оусень", "Идет Святый Пост." };
            string[] ac31 = new string[SIZE] { "Рамхатъ", "1", "31", "Оусень", "День Моисия Волхва. Последний день Святого Поста." };
            string[] ac32 = new string[SIZE] { "Рамхатъ", "1", "32", "Оусень", "" };
            string[] ac33 = new string[SIZE] { "Рамхатъ", "1", "33", "Оусень", "" };
            string[] ac34 = new string[SIZE] { "Рамхатъ", "1", "34", "Оусень", "" };
            string[] ac35 = new string[SIZE] { "Рамхатъ", "1", "35", "Оусень", "" };
            string[] ac36 = new string[SIZE] { "Рамхатъ", "1", "36", "Оусень", "День Сканда Ирийского." };
            string[] ac37 = new string[SIZE] { "Рамхатъ", "1", "37", "Оусень", "" };
            string[] ac38 = new string[SIZE] { "Рамхатъ", "1", "38", "Оусень", "День Богини Рожаны. Данная Богиня покровительствует роженицам." };
            string[] ac39 = new string[SIZE] { "Рамхатъ", "1", "39", "Оусень", "" };
            string[] ac40 = new string[SIZE] { "Рамхатъ", "1", "40", "Оусень", "День Мудрых Странников. Дидов День." };
            string[] ac41 = new string[SIZE] { "Рамхатъ", "1", "41", "Оусень", "" };

            string[] ac42 = new string[SIZE] { "Айлѣтъ", "2", "1", "Оусень", "" };
            string[] ac43 = new string[SIZE] { "Айлѣтъ", "2", "2", "Оусень", "День Мирослава Тарийского." };
            string[] ac44 = new string[SIZE] { "Айлѣтъ", "2", "3", "Оусень", "" };
            string[] ac45 = new string[SIZE] { "Айлѣтъ", "2", "4", "Оусень", "День Хария Предвечного." };
            string[] ac46 = new string[SIZE] { "Айлѣтъ", "2", "5", "Оусень", "" };
            string[] ac47 = new string[SIZE] { "Айлѣтъ", "2", "6", "Оусень", "" };
            string[] ac48 = new string[SIZE] { "Айлѣтъ", "2", "7", "Оусень", "День Родамира Тарийского." };
            string[] ac49 = new string[SIZE] { "Айлѣтъ", "2", "8", "Оусень", "" };
            string[] ac50 = new string[SIZE] { "Айлѣтъ", "2", "9", "Оусень", "" };
            string[] ac51 = new string[SIZE] { "Айлѣтъ", "2", "10", "Оусень", "" };
            string[] ac52 = new string[SIZE] { "Айлѣтъ", "2", "11", "Оусень", "" };
            string[] ac53 = new string[SIZE] { "Айлѣтъ", "2", "12", "Оусень", "День Богини Макоши. Богиня наших судеб, вместе с дочерьми Долей и Недолей, прядет нить наших судеб. Даже Боги подчинаются ее нитям." };
            string[] ac54 = new string[SIZE] { "Айлѣтъ", "2", "13", "Оусень", "День Олега Воителя." };
            string[] ac55 = new string[SIZE] { "Айлѣтъ", "2", "14", "Оусень", "" };
            string[] ac56 = new string[SIZE] { "Айлѣтъ", "2", "15", "Оусень", "" };
            string[] ac57 = new string[SIZE] { "Айлѣтъ", "2", "16", "Оусень", "День Посвященных Инглян." };
            string[] ac58 = new string[SIZE] { "Айлѣтъ", "2", "17", "Оусень", "" };
            string[] ac59 = new string[SIZE] { "Айлѣтъ", "2", "18", "Оусень", "" };
            string[] ac60 = new string[SIZE] { "Айлѣтъ", "2", "19", "Оусень", "День Аристарха Мудрого." };
            string[] ac61 = new string[SIZE] { "Айлѣтъ", "2", "20", "Оусень", "" };
            string[] ac62 = new string[SIZE] { "Айлѣтъ", "2", "21", "Оусень", "" };
            string[] ac63 = new string[SIZE] { "Айлѣтъ", "2", "22", "Зима", "День Откровения Богов." };
            string[] ac64 = new string[SIZE] { "Айлѣтъ", "2", "23", "Зима", "" };
            string[] ac65 = new string[SIZE] { "Айлѣтъ", "2", "24", "Зима", "" };
            string[] ac66 = new string[SIZE] { "Айлѣтъ", "2", "25", "Зима", "День Сварога и Семаргла. Сварог - Верховный Небесный Бог, управляющий теченьем Жизни нашей и всем Мироустройством Вселенной в Явном Мире. Бог Сварог и его сын Семаргл победили Черного змея и провели рубеж по Землям Мира Яви. Темная Навь была совлечена ниже Яви, а Славь осталась выше." };
            string[] ac67 = new string[SIZE] { "Айлѣтъ", "2", "26", "Зима", "" };
            string[] ac68 = new string[SIZE] { "Айлѣтъ", "2", "27", "Зима", "" };
            string[] ac69 = new string[SIZE] { "Айлѣтъ", "2", "28", "Зима", "" };
            string[] ac70 = new string[SIZE] { "Айлѣтъ", "2", "29", "Зима", "День Ярослава Мироустроителя." };
            string[] ac71 = new string[SIZE] { "Айлѣтъ", "2", "30", "Зима", "" };
            string[] ac72 = new string[SIZE] { "Айлѣтъ", "2", "31", "Зима", "" };
            string[] ac73 = new string[SIZE] { "Айлѣтъ", "2", "32", "Зима", "День Хорива Мудрого." };
            string[] ac74 = new string[SIZE] { "Айлѣтъ", "2", "33", "Зима", "" };
            string[] ac75 = new string[SIZE] { "Айлѣтъ", "2", "34", "Зима", "" };
            string[] ac76 = new string[SIZE] { "Айлѣтъ", "2", "35", "Зима", "" };
            string[] ac77 = new string[SIZE] { "Айлѣтъ", "2", "36", "Зима", "День Олега Праведного." };
            string[] ac78 = new string[SIZE] { "Айлѣтъ", "2", "37", "Зима", "" };
            string[] ac79 = new string[SIZE] { "Айлѣтъ", "2", "38", "Зима", "" };
            string[] ac80 = new string[SIZE] { "Айлѣтъ", "2", "39", "Зима", "" };
            string[] ac81 = new string[SIZE] { "Айлѣтъ", "2", "40", "Зима", "" };
            string[] ac366 = new string[SIZE] { "Айлѣтъ", "2", "41", "Зима", "" };

            string[] ac82 = new string[SIZE] { "Бейлѣтъ", "3", "1", "Зима", " Начало Даждьбожьего Поста (18 дней). День Даждьбога и Марены. Свадьба Даждьбога с Богиней Мареной. Даждьбог - Бог Тарх Перунович, Бог-Хранитель Древней Великой Мудрости. Был назван Даждьбогом за то, что дал людям Великой Расы и потомкам Рода Небесного Девять Сантий (книг). Марена (Мара) - Великая Богиня Зимы, Ночи, Вечного Сна и Вечной Жизни. В период поста мы готовим себя к переходу от раннеконсервируемой пищи на полностью консервируемую (соления, копчения и т.д). Непозволительно употреблять мясо, жирную рыбу, яйца, белый хлеб (только серый и ржаной, из полуночной опары), жирные молочные продукты и масло (растительное можно). Остальное также, как и в Святый Пост. Для улучшения обмена веществ, днем рекомендуется употреблять кислую капусту или гречневую кашу." };
            string[] ac83 = new string[SIZE] { "Бейлѣтъ", "3", "2", "Зима", "Идет Даждьбожий Пост." };
            string[] ac84 = new string[SIZE] { "Бейлѣтъ", "3", "3", "Зима", "Идет Даждьбожий Пост." };
            string[] ac85 = new string[SIZE] { "Бейлѣтъ", "3", "4", "Зима", "Идет Даждьбожий Пост. День Марьяны и Марены." };
            string[] ac86 = new string[SIZE] { "Бейлѣтъ", "3", "5", "Зима", "Идет Даждьбожий Пост." };
            string[] ac87 = new string[SIZE] { "Бейлѣтъ", "3", "6", "Зима", "Идет Даждьбожий Пост." };
            string[] ac88 = new string[SIZE] { "Бейлѣтъ", "3", "7", "Зима", "Идет Даждьбожий Пост. День Успокоения." };
            string[] ac89 = new string[SIZE] { "Бейлѣтъ", "3", "8", "Зима", "Идет Даждьбожий Пост." };
            string[] ac90 = new string[SIZE] { "Бейлѣтъ", "3", "9", "Зима", "Идет Даждьбожий Пост." };
            string[] ac91 = new string[SIZE] { "Бейлѣтъ", "3", "10", "Зима", "Идет Даждьбожий Пост." };
            string[] ac92 = new string[SIZE] { "Бейлѣтъ", "3", "11", "Зима", "Идет Даждьбожий Пост." };
            string[] ac93 = new string[SIZE] { "Бейлѣтъ", "3", "12", "Зима", "Идет Даждьбожий Пост." };
            string[] ac94 = new string[SIZE] { "Бейлѣтъ", "3", "13", "Зима", "Идет Даждьбожий Пост. День Перемен, Коляда. Рождение Бога Коляды. Также в этот день Перун победил зверя Скипетра и освободил из Пекла наших Предков, завлеченных туда обманом." };
            string[] ac95 = new string[SIZE] { "Бейлѣтъ", "3", "14", "Зима", "Идет Даждьбожий Пост." };
            string[] ac96 = new string[SIZE] { "Бейлѣтъ", "3", "15", "Зима", "Идет Даждьбожий Пост." };
            string[] ac97 = new string[SIZE] { "Бейлѣтъ", "3", "16", "Зима", "Идет Даждьбожий Пост." };
            string[] ac98 = new string[SIZE] { "Бейлѣтъ", "3", "17", "Зима", "Идет Даждьбожий Пост." };
            string[] ac99 = new string[SIZE] { "Бейлѣтъ", "3", "18", "Зима", "Последний день Даждьбожьего Поста. День Спасителя Расы." };
            string[] ac100 = new string[SIZE] { "Бейлѣтъ", "3", "19", "Зима", "" };
            string[] ac101 = new string[SIZE] { "Бейлѣтъ", "3", "20", "Зима", "День Всеволода Вечного." };
            string[] ac102 = new string[SIZE] { "Бейлѣтъ", "3", "21", "Зима", "" };
            string[] ac103 = new string[SIZE] { "Бейлѣтъ", "3", "22", "Зима", "День Великого Покоя. В этот день Бог Перун завалил Врата Междумирья, ведущие в Пекло (Кавказские горы)." };
            string[] ac104 = new string[SIZE] { "Бейлѣтъ", "3", "23", "Зима", "Неделя Памяти Праотцев. Неделя чествования Праотцев, освобожденных из Пекла." };
            string[] ac105 = new string[SIZE] { "Бейлѣтъ", "3", "24", "Зима", "Неделя Памяти Праотцев. Неделя чествования Праотцев, освобожденных из Пекла." };
            string[] ac106 = new string[SIZE] { "Бейлѣтъ", "3", "25", "Зима", "Неделя Памяти Праотцев. Неделя чествования Праотцев, освобожденных из Пекла." };
            string[] ac107 = new string[SIZE] { "Бейлѣтъ", "3", "26", "Зима", "Неделя Памяти Праотцев. Неделя чествования Праотцев, освобожденных из Пекла." };
            string[] ac108 = new string[SIZE] { "Бейлѣтъ", "3", "27", "Зима", "Неделя Памяти Праотцев. Неделя чествования Праотцев, освобожденных из Пекла." };
            string[] ac109 = new string[SIZE] { "Бейлѣтъ", "3", "28", "Зима", "Неделя Памяти Праотцев. Неделя чествования Праотцев, освобожденных из Пекла." };
            string[] ac110 = new string[SIZE] { "Бейлѣтъ", "3", "29", "Зима", "Родогощь. День победы Бога Велеса над Кощеем. Неделя Памяти Праотцев. Неделя чествования Праотцев, освобожденных из Пекла." };
            string[] ac111 = new string[SIZE] { "Бейлѣтъ", "3", "30", "Зима", "Неделя Памяти Праотцев. Неделя чествования Праотцев, освобожденных из Пекла." };
            string[] ac112 = new string[SIZE] { "Бейлѣтъ", "3", "31", "Зима", "Неделя Памяти Праотцев. Неделя чествования Праотцев, освобожденных из Пекла." };
            string[] ac113 = new string[SIZE] { "Бейлѣтъ", "3", "32", "Зима", "Неделя Памяти Праотцев. Неделя чествования Праотцев, освобожденных из Пекла." };
            string[] ac114 = new string[SIZE] { "Бейлѣтъ", "3", "33", "Зима", "День Бога Перуна. Вот, что пишется об этом празднике в Ведах. В далекой древности Бог Перун освободил из Пекла людей. Всех кого завлекли туда завлекли обманом и силой, и дал им возможность вернуться к Родным Очагам. Когда люди вышли из Пекла, Бог Перун завалил вход в Пекло (Врата Междумирья) Кавказскими горами. Но на землю, помимо людей выскользнула и всякая нечисть. Освобожденных людей с радостью встречали их родные. А когда к ним в дома стала заявляться нечисть, от нее откупались дарами. С той поры, люди отмечают Праздник Перемен (сейчас он известен как Коляда). Часть людей обряжаются в разных чудищ (ряженые), изображая нечисть, и ходят по домам. Чтобы не пускать нечисть (ряженых) в дом, и не иметь в доме несчастья, им на пороге дают откуп в виде печенья, сдобы и других вкусностей. Получив их нечисть уходит, ибо она хоть и любит все сладкое и вкусное, но терпеть не может радости и счастья. После Праздника Перемен (Менари), народ вспоминал о тех, кто так и не вернулся из Пекла. Поэтому в народе стали отмечать Неделю Памяти Предков. И пока люди вспоминали о всех своих Предках, Бог Перун ходил по земле и уничтожал нечисть. Ибо нечисть объедалась сладким так обильно, что не могла двигаться. 9 кругов пришлось сделать Перуну по Земле, по одному кругу в день, чтобы найти и уничтожить всю нечисть. И, как сказано в Ведах - и победиша злыя силы, вонзил в землю свой сияющий меч Бог Перун. Позже это отразилось в легенде о мече в камне. С той поры, люди стали отмечать Зимний День Перуна, как праздник победы над злом. Проходят 9 кругов по свастическому лабиринту, который называется Перунов Путь." };
            string[] ac115 = new string[SIZE] { "Бейлѣтъ", "3", "34", "Зима", "" };
            string[] ac116 = new string[SIZE] { "Бейлѣтъ", "3", "35", "Зима", "" };
            string[] ac117 = new string[SIZE] { "Бейлѣтъ", "3", "36", "Зима", "" };
            string[] ac118 = new string[SIZE] { "Бейлѣтъ", "3", "37", "Зима", "" };
            string[] ac119 = new string[SIZE] { "Бейлѣтъ", "3", "38", "Зима", "День Александра Основателя." };
            string[] ac120 = new string[SIZE] { "Бейлѣтъ", "3", "39", "Зима", "" };
            string[] ac121 = new string[SIZE] { "Бейлѣтъ", "3", "40", "Зима", "" };
            string[] ac122 = new string[SIZE] { "Бейлѣтъ", "3", "41", "Зима", "" };

            string[] ac123 = new string[SIZE] { "Гэйлѣтъ", "4", "1", "Зима", "" };
            string[] ac124 = new string[SIZE] { "Гэйлѣтъ", "4", "2", "Зима", "День Винитара Воителя." };
            string[] ac125 = new string[SIZE] { "Гэйлѣтъ", "4", "3", "Зима", "" };
            string[] ac126 = new string[SIZE] { "Гэйлѣтъ", "4", "4", "Зима", "" };
            string[] ac127 = new string[SIZE] { "Гэйлѣтъ", "4", "5", "Зима", "" };
            string[] ac128 = new string[SIZE] { "Гэйлѣтъ", "4", "6", "Зима", "" };
            string[] ac129 = new string[SIZE] { "Гэйлѣтъ", "4", "7", "Зима", "День Горислава Мученика." };
            string[] ac130 = new string[SIZE] { "Гэйлѣтъ", "4", "8", "Зима", "" };
            string[] ac131 = new string[SIZE] { "Гэйлѣтъ", "4", "9", "Зима", "" };
            string[] ac132 = new string[SIZE] { "Гэйлѣтъ", "4", "10", "Зима", "" };
            string[] ac133 = new string[SIZE] { "Гэйлѣтъ", "4", "11", "Зима", "" };
            string[] ac134 = new string[SIZE] { "Гэйлѣтъ", "4", "12", "Зима", "День Светозара Вечного." };
            string[] ac135 = new string[SIZE] { "Гэйлѣтъ", "4", "13", "Зима", "" };
            string[] ac136 = new string[SIZE] { "Гэйлѣтъ", "4", "14", "Зима", "" };
            string[] ac137 = new string[SIZE] { "Гэйлѣтъ", "4", "15", "Зима", "" };
            string[] ac138 = new string[SIZE] { "Гэйлѣтъ", "4", "16", "Зима", "" };
            string[] ac139 = new string[SIZE] { "Гэйлѣтъ", "4", "17", "Зима", "День Хария Праведного." };
            string[] ac140 = new string[SIZE] { "Гэйлѣтъ", "4", "18", "Зима", "" };
            string[] ac141 = new string[SIZE] { "Гэйлѣтъ", "4", "19", "Зима", "" };
            string[] ac142 = new string[SIZE] { "Гэйлѣтъ", "4", "20", "Зима", "" };
            string[] ac143 = new string[SIZE] { "Гэйлѣтъ", "4", "21", "Зима", "" };
            string[] ac144 = new string[SIZE] { "Гэйлѣтъ", "4", "22", "Зима", "День Рамхата Странника." };
            string[] ac145 = new string[SIZE] { "Гэйлѣтъ", "4", "23", "Зима", "Начало Чистого Поста (18 дней). В этот период непозволительно употреблять пищу: мясную, жирную, кислую (квашенную), яйца, запрещено масло (и растительное и животное). Можно: нежирную рыбу (не жареную), крупяные изделия, серый и ржаной хлеб, орехи, соки, травяные чаи, зернобобовые (в малых количествах). Во вторую неделю Поста, постепенно вводится свежая растительная пища (зеленый лук, редис и т.д)." };
            string[] ac146 = new string[SIZE] { "Гэйлѣтъ", "4", "24", "Зима", "Идет Чистый Пост." };
            string[] ac147 = new string[SIZE] { "Гэйлѣтъ", "4", "25", "Зима", "Идет Чистый Пост." };
            string[] ac148 = new string[SIZE] { "Гэйлѣтъ", "4", "26", "Зима", "Идет Чистый Пост." };
            string[] ac149 = new string[SIZE] { "Гэйлѣтъ", "4", "27", "Зима", "Идет Чистый Пост." };
            string[] ac150 = new string[SIZE] { "Гэйлѣтъ", "4", "28", "Зима", "Идет Чистый Пост." };
            string[] ac151 = new string[SIZE] { "Гэйлѣтъ", "4", "29", "Зима", "Идет Чистый Пост." };
            string[] ac152 = new string[SIZE] { "Гэйлѣтъ", "4", "30", "Зима", "Идет Чистый Пост." };
            string[] ac153 = new string[SIZE] { "Гэйлѣтъ", "4", "31", "Зима", "Идет Чистый Пост." };
            string[] ac154 = new string[SIZE] { "Гэйлѣтъ", "4", "32", "Зима", "Идет Чистый Пост." };
            string[] ac155 = new string[SIZE] { "Гэйлѣтъ", "4", "33", "Зима", "Идет Чистый Пост. День Дида. День поминовения всех Дедов по Родовой (Отцовской) линии, с посещением кладбищ, погостов, отдельных могил и курганов." };
            string[] ac156 = new string[SIZE] { "Гэйлѣтъ", "4", "34", "Зима", "Идет Чистый Пост." };
            string[] ac157 = new string[SIZE] { "Гэйлѣтъ", "4", "35", "Зима", "Идет Чистый Пост." };
            string[] ac158 = new string[SIZE] { "Гэйлѣтъ", "4", "36", "Зима", "Идет Чистый Пост." };
            string[] ac159 = new string[SIZE] { "Гэйлѣтъ", "4", "37", "Зима", "Идет Чистый Пост. День Бога Велеса. Бог-Покровитель скотоводов и животноводов, а также Родовой Покровитель западных Славян-Скоттов (Шотландцев). Бог Велес, охраняя Небесные Врата Междумирья, пропускает во Сваргу Пречистую Души только тех усопших, кто не щадил своей жизни во защиту Родов своих, во защиту земель Отцов и Дедов, во защиту Древней Веры, которые усердно и созидательно трудились для процветания своих Родов, и которые от чистого сердца выполняли Два Великих Принципа: Свято чтить Богов и Предков своих, и живших по Совести, в Гармонии с Матерью-Природой." };
            string[] ac160 = new string[SIZE] { "Гэйлѣтъ", "4", "38", "Зима", "Идет Чистый Пост." };
            string[] ac161 = new string[SIZE] { "Гэйлѣтъ", "4", "39", "Зима", "Идет Чистый Пост." };
            string[] ac162 = new string[SIZE] { "Гэйлѣтъ", "4", "40", "Зима", "Последний день Чистого Поста. День Храма Души. День, когда человек должен навести порядок в своей Душе. Он должен посетить службу в Храме, принести дары Богам и Предкам, принять Чистый Свет в свою Душу от Храмовой Огневицы. Этот день завершает Чистый Пост." };
            string[] ac367 = new string[SIZE] { "Гэйлѣтъ", "4", "41", "Зима", "" };

            string[] ac163 = new string[SIZE] { "Дайлѣтъ", "5", "1", "Зима", "" };
            string[] ac164 = new string[SIZE] { "Дайлѣтъ", "5", "2", "Зима", "День Вечезара Мученика." };
            string[] ac165 = new string[SIZE] { "Дайлѣтъ", "5", "3", "Зима", "" };
            string[] ac166 = new string[SIZE] { "Дайлѣтъ", "5", "4", "Зима", "" };
            string[] ac167 = new string[SIZE] { "Дайлѣтъ", "5", "5", "Зима", "День Аристарха Воителя." };
            string[] ac168 = new string[SIZE] { "Дайлѣтъ", "5", "6", "Зима", "День Боруслава Асгардского." };
            string[] ac169 = new string[SIZE] { "Дайлѣтъ", "5", "7", "Зима", "" };
            string[] ac170 = new string[SIZE] { "Дайлѣтъ", "5", "8", "Зима", "" };
            string[] ac171 = new string[SIZE] { "Дайлѣтъ", "5", "9", "Зима", "" };
            string[] ac172 = new string[SIZE] { "Дайлѣтъ", "5", "10", "Зима", "" };
            string[] ac173 = new string[SIZE] { "Дайлѣтъ", "5", "11", "Зима", "" };
            string[] ac174 = new string[SIZE] { "Дайлѣтъ", "5", "12", "Зима", "" };
            string[] ac175 = new string[SIZE] { "Дайлѣтъ", "5", "13", "Зима", "" };
            string[] ac176 = new string[SIZE] { "Дайлѣтъ", "5", "14", "Зима", "День Ратибора Странника." };
            string[] ac177 = new string[SIZE] { "Дайлѣтъ", "5", "15", "Зима", "" };
            string[] ac178 = new string[SIZE] { "Дайлѣтъ", "5", "16", "Зима", "" };
            string[] ac179 = new string[SIZE] { "Дайлѣтъ", "5", "17", "Зима", "День Дмитрия Капена." };
            string[] ac180 = new string[SIZE] { "Дайлѣтъ", "5", "18", "Зима", "" };
            string[] ac181 = new string[SIZE] { "Дайлѣтъ", "5", "19", "Зима", "День Игоря Воителя." };
            string[] ac182 = new string[SIZE] { "Дайлѣтъ", "5", "20", "Весна", "" };
            string[] ac183 = new string[SIZE] { "Дайлѣтъ", "5", "21", "Весна", "" };
            string[] ac184 = new string[SIZE] { "Дайлѣтъ", "5", "22", "Весна", "День Весты, Богини Весны. День Весеннего Равноденствия. В этот день празднуется приход на землю Весны, прилет птиц. Во всех Родах пекут из теста фигурки жаворонков, оладьи и печенье с Солнечной символикой." };
            string[] ac185 = new string[SIZE] { "Дайлѣтъ", "5", "23", "Весна", "Начало Великого Поста (13 дней). Красногор. Масленница. Второй День Весеннего Равноденствия. В этот день празднуются проводы Богини Зимы Марены в ее Ледяные Чертоги, находящиеся на севере. В этот день зажигается огромное огневище (костер), в которое каждый присутствующий на празднике, кладет маленькую куколку, сделанную из соломы, на которую наговариваются пожелания счастья, радости, хорошего урожая и т.д. Вместе с куклой в огонь кладутся блины и зерна (просо, овес для произрастания обильной пищи для домашней скотины), чтобы Боги даровали обильный урожай. Проводятся народные гуляния и прыжки через отдельное (не жертвенное) огневище, чтобы очистить свои Душу и Телеса. Водятся хороводы, игрища и т.д. В эти два дня Весеннего Равноденствия запрещается употребление хмельных и спиртных напитков. Не пейте питья хмельного, не скажите бранного слова. Не употребление соблюдается всеми, кроме мужей, достигших возраста 3 Круга Лет (48 лет), выполнивших Долг перед Родом (9 детей) - 1 чарка, или имеющих Потомственный Круг (16 и более детей) - 2 чарки Сурицы (27 грамм). Чарки им наливает Родан (Предводитель Рода). В период Поста непозволительно употреблять жирную мясную пищу (кроме мяса курицы и кролика), жирную рыбу, масло (кроме растительного), молочные продукты. Все остальное нежирное можно." };
            string[] ac186 = new string[SIZE] { "Дайлѣтъ", "5", "24", "Весна", "Идет Великий Пост. День Хария Мученика." };
            string[] ac187 = new string[SIZE] { "Дайлѣтъ", "5", "25", "Весна", "Идет Великий Пост. День Богуслава Мученика." };
            string[] ac188 = new string[SIZE] { "Дайлѣтъ", "5", "26", "Весна", "Идет Великий Пост. День Трислава Воителя." };
            string[] ac189 = new string[SIZE] { "Дайлѣтъ", "5", "27", "Весна", "Идет Великий Пост. День Ла(е)ды Воительницы." };
            string[] ac190 = new string[SIZE] { "Дайлѣтъ", "5", "28", "Весна", "Идет Великий Пост. День Богини Тары. Тара - младшая сестра Тарха Даждьбога. В этот день чествуется Богиня Тара - Покровительница Священных Лесов и Деревьев. Ей преподносятся Дары и Требы. В огненный жертвенник ложатся семена и зерна для обильного урожая, необходимого для питания людей. В этот день в ее честь проводится Служба и Великая Братчина - совместная трапеза, чаепитие, пир, учавствующих в празднике. Яства приносят участники, которые они создали собственными руками для общего стола. Перед началом Великой Трапезы, от каждого блюда берется по-немногу, чтобы принести Жертву Богине Таре и остальным Богам и Предкам." };
            string[] ac191 = new string[SIZE] { "Дайлѣтъ", "5", "29", "Весна", "Идет Великий Пост. День Святозара Спасителя." };
            string[] ac192 = new string[SIZE] { "Дайлѣтъ", "5", "30", "Весна", "Идет Великий Пост. День Сергия Лучезарного." };
            string[] ac193 = new string[SIZE] { "Дайлѣтъ", "5", "31", "Весна", "Идет Великий Пост. День Ратислава Асгардского." };
            string[] ac194 = new string[SIZE] { "Дайлѣтъ", "5", "32", "Весна", "Идет Великий Пост. День Руслана Воителя." };
            string[] ac195 = new string[SIZE] { "Дайлѣтъ", "5", "33", "Весна", "Идет Великий Пост. День Одина Асгардского." };
            string[] ac196 = new string[SIZE] { "Дайлѣтъ", "5", "34", "Весна", "Идет Великий Пост. День Тора Свентоградского." };
            string[] ac197 = new string[SIZE] { "Дайлѣтъ", "5", "35", "Весна", "Последний день Великого Поста. День Памяти Предков. День, в который почитаются все Предки всех Родов. В этот день совершаются Службы на всех кладбищах и погостах, на могилах и курганах наводится чистота и порядок. Помимо Даров и Треб умершим Родичам, на их последнем пристанище зажигаются Священные Огни (свечи, лампады, огневицы)." };
            string[] ac198 = new string[SIZE] { "Дайлѣтъ", "5", "36", "Весна", "Пасхет. Путь Асами Ходяше Есть Твердо Сотворение - День Памяти о 15-летнем переселении Наших Великих Предков из Даарии в Рассению и Беловодье. Память о том, как Предки Наши в 16-е лето славили всех Богов и жреца Спаса, за спасение от Потопа Великого." };
            string[] ac199 = new string[SIZE] { "Дайлѣтъ", "5", "37", "Весна", "День Митры Спасителя. День почитания Бога Митры, который спас Роды Рассенов и Святорусов от засухи, даровал им воду и пищу, и указал каким Родам в какие земли цветущие переселиться. За то, что Митра спас Роды, Темные Силы его приковали цепями к горам Кавказским, и посылали диких птиц клевать его плоть. Митра три дня находился между Жизнью и Смертью. Из Родов Святорусов была избрана дружина из тридевяти наилучших воинов, которую возглавила жрица-воительница АсТара. Она привела воинов к месту мучения Митры, где были разбиты Темные Силы, освободила Митру из оков, оживила его Силой своей Любви, после чего на Огненной Божественной Колеснице поднялась с Митрой в Небеса. С той поры многие Рода южной Скифии, почитали АсТару как Богиню Высшей Спасительной Любви и Возрождения. Отсюда появились легенды о том, что распятые Боги в третий день воскресают, так как на Кавказских горах был распят и Тарх Даждьбог, спасенный Лебедью-Дживой." };
            string[] ac200 = new string[SIZE] { "Дайлѣтъ", "5", "38", "Весна", "День Возрождения Тарха. Тарх Даждьбог сражался с Темными Силами и они запросили пощады, перемирия и устроили пир. На пире в питье Тарху подсыпали сонного зелья. А когда он уснул, приковали его цепями к горам Кавказским, чтобы хищные птицы и звери терзали его плоть. Богиня Джива освободила его от оков, перенесла на своих Лебединых Крыльях в Урочище Тары, на слияние Раты и Ирия, где вместе с сестрой Тарха - Богиней Тарой, они залечили его телесные раны. А Богиня Джива, Силой Высшей Спасительной Любви и Возрождения, вдохнула в него новые силы и жизнь. После чего состоялась свадьба Тарха Даждьбога и Богини Дживы. Даждьбог, также как и Митра, был три дня прикован к Кавказским горам, и находился между жизнью и смертью." };
            string[] ac201 = new string[SIZE] { "Дайлѣтъ", "5", "39", "Весна", "" };
            string[] ac202 = new string[SIZE] { "Дайлѣтъ", "5", "40", "Весна", "День Айвана Вечного." };
            string[] ac203 = new string[SIZE] { "Дайлѣтъ", "5", "41", "Весна", "" };

            string[] ac204 = new string[SIZE] { "Ѥлѣтъ", "6", "1", "Весна", "Дни Наречения. В месяц Элет, когда Природа расцветает, и на земле просыпаются все Природные Силы, происходят Обряды Наречения (новым именем, женихом и невестой, жрецами, волхвами, князьями, ханами, витязями, дружинниками и т.д.)" };
            string[] ac205 = new string[SIZE] { "Ѥлѣтъ", "6", "2", "Весна", "" };
            string[] ac206 = new string[SIZE] { "Ѥлѣтъ", "6", "3", "Весна", "" };
            string[] ac207 = new string[SIZE] { "Ѥлѣтъ", "6", "4", "Весна", "День Вечеслава Ирийского." };
            string[] ac208 = new string[SIZE] { "Ѥлѣтъ", "6", "5", "Весна", "" };
            string[] ac209 = new string[SIZE] { "Ѥлѣтъ", "6", "6", "Весна", "" };
            string[] ac210 = new string[SIZE] { "Ѥлѣтъ", "6", "7", "Весна", "" };
            string[] ac211 = new string[SIZE] { "Ѥлѣтъ", "6", "8", "Весна", "" };
            string[] ac212 = new string[SIZE] { "Ѥлѣтъ", "6", "9", "Весна", "" };
            string[] ac213 = new string[SIZE] { "Ѥлѣтъ", "6", "10", "Весна", "" };
            string[] ac214 = new string[SIZE] { "Ѥлѣтъ", "6", "11", "Весна", "День Аристарха Праведника." };
            string[] ac215 = new string[SIZE] { "Ѥлѣтъ", "6", "12", "Весна", "" };
            string[] ac216 = new string[SIZE] { "Ѥлѣтъ", "6", "13", "Весна", "День Лели Небесной. В этот день празднуется День Победы Даждьбога над Темными Силами, которых Кощеи собрали на Леле (ближайшей к Мидгарду луне, а было в то время 3 луны). Даждьбог разрушил малую луну Лелю и уничтожил Темные Силы, которые готовились к захвату Мидгарда (нашей Земли). С той поры, существует обычай на День Лели Небесной, красить птичьи яйца и стукать их друг об друга. Разбившееся яйцо называют Яйцом Кощея, а целое - Силой Даждьбога. Разбитое яйцо всегда отдают недругам или животным, а целое съедают сами. Также в этот день прославляется Богиня Леля, дочь Лады Богородицы." };
            string[] ac217 = new string[SIZE] { "Ѥлѣтъ", "6", "14", "Весна", "" };
            string[] ac218 = new string[SIZE] { "Ѥлѣтъ", "6", "15", "Весна", "" };
            string[] ac219 = new string[SIZE] { "Ѥлѣтъ", "6", "16", "Весна", "День Борислава Спасителя." };
            string[] ac220 = new string[SIZE] { "Ѥлѣтъ", "6", "17", "Весна", "" };
            string[] ac221 = new string[SIZE] { "Ѥлѣтъ", "6", "18", "Весна", "" };
            string[] ac222 = new string[SIZE] { "Ѥлѣтъ", "6", "19", "Весна", "День Родомира Ведуна. Родительский День." };
            string[] ac223 = new string[SIZE] { "Ѥлѣтъ", "6", "20", "Весна", "" };
            string[] ac224 = new string[SIZE] { "Ѥлѣтъ", "6", "21", "Весна", "" };
            string[] ac225 = new string[SIZE] { "Ѥлѣтъ", "6", "22", "Весна", "День Мудрости Крышеня." };
            string[] ac226 = new string[SIZE] { "Ѥлѣтъ", "6", "23", "Весна", "" };
            string[] ac227 = new string[SIZE] { "Ѥлѣтъ", "6", "24", "Весна", "" };
            string[] ac228 = new string[SIZE] { "Ѥлѣтъ", "6", "25", "Весна", "" };
            string[] ac229 = new string[SIZE] { "Ѥлѣтъ", "6", "26", "Весна", "Святочь." };
            string[] ac230 = new string[SIZE] { "Ѥлѣтъ", "6", "27", "Весна", "" };
            string[] ac231 = new string[SIZE] { "Ѥлѣтъ", "6", "28", "Весна", "" };
            string[] ac232 = new string[SIZE] { "Ѥлѣтъ", "6", "29", "Весна", "День Ведамира Асгардского." };
            string[] ac233 = new string[SIZE] { "Ѥлѣтъ", "6", "30", "Весна", "" };
            string[] ac234 = new string[SIZE] { "Ѥлѣтъ", "6", "31", "Весна", "" };
            string[] ac235 = new string[SIZE] { "Ѥлѣтъ", "6", "32", "Весна", "" };
            string[] ac236 = new string[SIZE] { "Ѥлѣтъ", "6", "33", "Весна", "Веда-Инта. ИНТА (Истина Наши Твердо Асы) - день, когда почитается Мудрость, которую оставили нам все Светлые Боги и Многомудрые Предки." };
            string[] ac237 = new string[SIZE] { "Ѥлѣтъ", "6", "34", "Весна", "" };
            string[] ac238 = new string[SIZE] { "Ѥлѣтъ", "6", "35", "Весна", "" };
            string[] ac239 = new string[SIZE] { "Ѥлѣтъ", "6", "36", "Весна", "" };
            string[] ac240 = new string[SIZE] { "Ѥлѣтъ", "6", "37", "Весна", "День Матери Сырой-Земли. День чествования Богини Матери Сырой-Земли. В этот день ей приносят в жертву лучшие семена, фрукты, овощи и просят, чтобы все что идет в огонь, было в изобилии в Родах. В этот день многие овощи и фрукты высаживаются в открытый грунт, а также высеваются различные злаковые культуры." };
            string[] ac241 = new string[SIZE] { "Ѥлѣтъ", "6", "38", "Весна", "" };
            string[] ac242 = new string[SIZE] { "Ѥлѣтъ", "6", "39", "Весна", "" };
            string[] ac243 = new string[SIZE] { "Ѥлѣтъ", "6", "40", "Весна", "День Лады Богородицы. Лада-Матушка (Матерь-Сва) - Великая Небесная Мать, Богородица. Любящая и нежная Мать большинства Светлых Богов Расы Великой, Богородица-Покровительница всех Народов Великой Рассении (территория Великой Расы) и Чертога Лося во Сварожьем Круге. Покровительница семьи, гармонии, красоты и любви." };
            string[] ac368 = new string[SIZE] { "Ѥлѣтъ", "6", "41", "Весна", "" };

            string[] ac244 = new string[SIZE] { "Вейлѣтъ", "7", "1", "Весна", "" };
            string[] ac245 = new string[SIZE] { "Вейлѣтъ", "7", "2", "Весна", "" };
            string[] ac246 = new string[SIZE] { "Вейлѣтъ", "7", "3", "Весна", "" };
            string[] ac247 = new string[SIZE] { "Вейлѣтъ", "7", "4", "Весна", "" };
            string[] ac248 = new string[SIZE] { "Вейлѣтъ", "7", "5", "Весна", "День Всеволода Мудрого." };
            string[] ac249 = new string[SIZE] { "Вейлѣтъ", "7", "6", "Весна", "" };
            string[] ac250 = new string[SIZE] { "Вейлѣтъ", "7", "7", "Весна", "" };
            string[] ac251 = new string[SIZE] { "Вейлѣтъ", "7", "8", "Весна", "" };
            string[] ac252 = new string[SIZE] { "Вейлѣтъ", "7", "9", "Весна", "День Бога Вышеня. Вышень - Бог-Покровитель нашей Вселенной в Светлых Мирах Нави, т.е. Мирах Слави. Заботливый и могучий Отец Бога Сварога. Справедливый судья, разрешающий любые споры, которые возникают между Богами различных Миров или между людьми." };
            string[] ac253 = new string[SIZE] { "Вейлѣтъ", "7", "10", "Весна", "" };
            string[] ac254 = new string[SIZE] { "Вейлѣтъ", "7", "11", "Весна", "" };
            string[] ac255 = new string[SIZE] { "Вейлѣтъ", "7", "12", "Весна", "День Бога Яровита." };
            string[] ac256 = new string[SIZE] { "Вейлѣтъ", "7", "13", "Весна", "" };
            string[] ac257 = new string[SIZE] { "Вейлѣтъ", "7", "14", "Весна", "День Ратибора Воителя." };
            string[] ac258 = new string[SIZE] { "Вейлѣтъ", "7", "15", "Весна", "" };
            string[] ac259 = new string[SIZE] { "Вейлѣтъ", "7", "16", "Весна", "" };
            string[] ac260 = new string[SIZE] { "Вейлѣтъ", "7", "17", "Весна", "" };
            string[] ac261 = new string[SIZE] { "Вейлѣтъ", "7", "18", "Весна", "День Мудрости Будха." };
            string[] ac262 = new string[SIZE] { "Вейлѣтъ", "7", "19", "Весна", "" };
            string[] ac263 = new string[SIZE] { "Вейлѣтъ", "7", "20", "Весна", "" };
            string[] ac264 = new string[SIZE] { "Вейлѣтъ", "7", "21", "Весна", "" };
            string[] ac265 = new string[SIZE] { "Вейлѣтъ", "7", "22", "Весна", "День РаМХа-Инта. Истина Наши Твердо Асы. Мудрость РаМХи - Единый Творец-Созидатель, Вышняя Непознаваемая Сущность, излучающая Изначальный Жизньродящий Свет Радости и Первичный Огонь Мироздания (Жизньродящую Инглию), из которого появились все ныне существующие, а также существовавшие в прошлом видимые и невидимые Вселенные и всевозможные обитаемые Миры." };
            string[] ac266 = new string[SIZE] { "Вейлѣтъ", "7", "23", "Весна", "" };
            string[] ac267 = new string[SIZE] { "Вейлѣтъ", "7", "24", "Весна", "" };
            string[] ac268 = new string[SIZE] { "Вейлѣтъ", "7", "25", "Весна", "День Ведаслава Праведника." };
            string[] ac269 = new string[SIZE] { "Вейлѣтъ", "7", "26", "Весна", "" };
            string[] ac270 = new string[SIZE] { "Вейлѣтъ", "7", "27", "Весна", "Триглав. День, когда почитаются Великие Триглавы." };
            string[] ac271 = new string[SIZE] { "Вейлѣтъ", "7", "28", "Весна", "" };
            string[] ac272 = new string[SIZE] { "Вейлѣтъ", "7", "29", "Весна", "" };
            string[] ac273 = new string[SIZE] { "Вейлѣтъ", "7", "30", "Весна", "Родоница." };
            string[] ac274 = new string[SIZE] { "Вейлѣтъ", "7", "31", "Весна", "День Числобога. Числобог - Мудрый Вышний Бог, управляющий течением Реки Времени, а также Бог-Хранитель Даарийского Круголета и различных Жреческих Систем Славяно-Арийского летоисчисления." };
            string[] ac275 = new string[SIZE] { "Вейлѣтъ", "7", "32", "Весна", "День Ладаада." };
            string[] ac276 = new string[SIZE] { "Вейлѣтъ", "7", "33", "Весна", "Начало Светлого Поста (18 дней). День Бога Хорса. Праздник начинается с Прославления Бога Хорса и принесения Жертв Безкровных (круглые куличики) на жертвенник. После чего устраиваются хороводы, хороводные пляски (медленные движения с подражаньем словам хороводной, протяжной песни). В летний праздник Бога Хорса, с горы к реке обязательно скатывают большое горящее колесо, символизирующее солярный знак Солнца. В период Поста позволительно употреблять только утром и вечером одну лишь растительную пищу. А в День Бога Купалы, можно есть мясо, но оно должно быть приготовлено на Живом Огне (костер, запаленный от Живого Огня)." };
            string[] ac277 = new string[SIZE] { "Вейлѣтъ", "7", "34", "Весна", "Идет Светлый Пост. День Ясуни." };
            string[] ac278 = new string[SIZE] { "Вейлѣтъ", "7", "35", "Весна", "Идет Светлый Пост. День Родовита." };
            string[] ac279 = new string[SIZE] { "Вейлѣтъ", "7", "36", "Весна", "Идет Светлый Пост. День Подзвезда." };
            string[] ac280 = new string[SIZE] { "Вейлѣтъ", "7", "37", "Весна", "Идет Светлый Пост. День Родарита." };
            string[] ac281 = new string[SIZE] { "Вейлѣтъ", "7", "38", "Весна", "Идет Светлый Пост. День Родагоста." };
            string[] ac282 = new string[SIZE] { "Вейлѣтъ", "7", "39", "Весна", "Идет Светлый Пост. День Крода." };
            string[] ac283 = new string[SIZE] { "Вейлѣтъ", "7", "40", "Весна", "Идет Светлый Пост. Русалии." };
            string[] ac284 = new string[SIZE] { "Вейлѣтъ", "7", "41", "Весна", "Идет Светлый Пост. Русалии." };

            string[] ac285 = new string[SIZE] { "Хейлѣтъ", "8", "1", "Весна", "Идет Светлый Пост. Русалии." };
            string[] ac286 = new string[SIZE] { "Хейлѣтъ", "8", "2", "Весна", "Идет Светлый Пост. День Ярилы-Солнца. Почитается наше Солнце, которое дарует нам тепло и свет." };
            string[] ac287 = new string[SIZE] { "Хейлѣтъ", "8", "3", "Весна", "Идет Светлый Пост. День Омовения." };
            string[] ac288 = new string[SIZE] { "Хейлѣтъ", "8", "4", "Весна", "Идет Светлый Пост. Русалии." };
            string[] ac289 = new string[SIZE] { "Хейлѣтъ", "8", "5", "Весна", "Идет Светлый Пост. Русалии." };
            string[] ac290 = new string[SIZE] { "Хейлѣтъ", "8", "6", "Весна", "Идет Светлый Пост. Русалии." };
            string[] ac291 = new string[SIZE] { "Хейлѣтъ", "8", "7", "Весна", "Идет Светлый Пост. День Бога Купала. Почитается Бог Купала. Люди проходят очищение в пяти Стихиях." };
            string[] ac292 = new string[SIZE] { "Хейлѣтъ", "8", "8", "Весна", "Идет Светлый Пост. День Зари-Мерцаны." };
            string[] ac293 = new string[SIZE] { "Хейлѣтъ", "8", "9", "Весна", "Последний день Светлого Поста. День Великой Инглии." };
            string[] ac294 = new string[SIZE] { "Хейлѣтъ", "8", "10", "Весна", "" };
            string[] ac295 = new string[SIZE] { "Хейлѣтъ", "8", "11", "Весна", "" };
            string[] ac296 = new string[SIZE] { "Хейлѣтъ", "8", "12", "Весна", "" };
            string[] ac297 = new string[SIZE] { "Хейлѣтъ", "8", "13", "Весна", "День Александра Странника." };
            string[] ac298 = new string[SIZE] { "Хейлѣтъ", "8", "14", "Весна", "" };
            string[] ac299 = new string[SIZE] { "Хейлѣтъ", "8", "15", "Весна", "" };
            string[] ac300 = new string[SIZE] { "Хейлѣтъ", "8", "16", "Весна", "" };
            string[] ac301 = new string[SIZE] { "Хейлѣтъ", "8", "17", "Весна", "День Земли Свята Расы." };
            string[] ac302 = new string[SIZE] { "Хейлѣтъ", "8", "18", "Весна", "День Орея Вендагардского." };
            string[] ac303 = new string[SIZE] { "Хейлѣтъ", "8", "19", "Оусень", "" };
            string[] ac304 = new string[SIZE] { "Хейлѣтъ", "8", "20", "Оусень", "" };
            string[] ac305 = new string[SIZE] { "Хейлѣтъ", "8", "21", "Оусень", "Перуница. День почитания жены Бога Перуна - Дивы." };
            string[] ac306 = new string[SIZE] { "Хейлѣтъ", "8", "22", "Оусень", "День Сбора Плодов." };
            string[] ac307 = new string[SIZE] { "Хейлѣтъ", "8", "23", "Оусень", "" };
            string[] ac308 = new string[SIZE] { "Хейлѣтъ", "8", "24", "Оусень", "" };
            string[] ac309 = new string[SIZE] { "Хейлѣтъ", "8", "25", "Оусень", "" };
            string[] ac310 = new string[SIZE] { "Хейлѣтъ", "8", "26", "Оусень", "" };
            string[] ac311 = new string[SIZE] { "Хейлѣтъ", "8", "27", "Оусень", "День Бога Удрзеца." };
            string[] ac312 = new string[SIZE] { "Хейлѣтъ", "8", "28", "Оусень", "" };
            string[] ac313 = new string[SIZE] { "Хейлѣтъ", "8", "29", "Оусень", "" };
            string[] ac314 = new string[SIZE] { "Хейлѣтъ", "8", "30", "Оусень", "День Игоря Святомудрого." };
            string[] ac315 = new string[SIZE] { "Хейлѣтъ", "8", "31", "Оусень", "" };
            string[] ac316 = new string[SIZE] { "Хейлѣтъ", "8", "32", "Оусень", "" };
            string[] ac317 = new string[SIZE] { "Хейлѣтъ", "8", "33", "Оусень", "Вышний День Перуна. День почитания Бога Перуна." };
            string[] ac318 = new string[SIZE] { "Хейлѣтъ", "8", "34", "Оусень", "День Летиницы." };
            string[] ac319 = new string[SIZE] { "Хейлѣтъ", "8", "35", "Оусень", "РИТА." };
            string[] ac320 = new string[SIZE] { "Хейлѣтъ", "8", "36", "Оусень", "" };
            string[] ac321 = new string[SIZE] { "Хейлѣтъ", "8", "37", "Оусень", "" };
            string[] ac322 = new string[SIZE] { "Хейлѣтъ", "8", "38", "Оусень", "День Александра Ярославича." };
            string[] ac323 = new string[SIZE] { "Хейлѣтъ", "8", "39", "Оусень", "" };
            string[] ac324 = new string[SIZE] { "Хейлѣтъ", "8", "40", "Оусень", "Житнич." };
            string[] ac369 = new string[SIZE] { "Хейлѣтъ", "8", "41", "Оусень", "" };

            string[] ac325 = new string[SIZE] { "Тайлѣтъ", "9", "1", "Оусень", "" };
            string[] ac326 = new string[SIZE] { "Тайлѣтъ", "9", "2", "Оусень", "" };
            string[] ac327 = new string[SIZE] { "Тайлѣтъ", "9", "3", "Оусень", "День Ворона Варуны." };
            string[] ac328 = new string[SIZE] { "Тайлѣтъ", "9", "4", "Оусень", "" };
            string[] ac329 = new string[SIZE] { "Тайлѣтъ", "9", "5", "Оусень", "" };
            string[] ac330 = new string[SIZE] { "Тайлѣтъ", "9", "6", "Оусень", "День Александра Мудрого." };
            string[] ac331 = new string[SIZE] { "Тайлѣтъ", "9", "7", "Оусень", "" };
            string[] ac332 = new string[SIZE] { "Тайлѣтъ", "9", "8", "Оусень", "" };
            string[] ac333 = new string[SIZE] { "Тайлѣтъ", "9", "9", "Оусень", "День Трех Лун. В этот день, когда в Древние времена вокруг Земли вращались три луны, они сошлись на небосводе в одном месте. В этот день было начато строительство Асгарда Ирийского и Великого Капища Инглии (Великого Храма Священного Первичного Огня). Этот день считается днем основания Священного Города Богов, построенного на слиянии рек Ирий и Омь." };
            string[] ac334 = new string[SIZE] { "Тайлѣтъ", "9", "10", "Оусень", "" };
            string[] ac335 = new string[SIZE] { "Тайлѣтъ", "9", "11", "Оусень", "" };
            string[] ac336 = new string[SIZE] { "Тайлѣтъ", "9", "12", "Оусень", "День Скифия Волхва." };
            string[] ac337 = new string[SIZE] { "Тайлѣтъ", "9", "13", "Оусень", "" };
            string[] ac338 = new string[SIZE] { "Тайлѣтъ", "9", "14", "Оусень", "" };
            string[] ac339 = new string[SIZE] { "Тайлѣтъ", "9", "15", "Оусень", "" };
            string[] ac340 = new string[SIZE] { "Тайлѣтъ", "9", "16", "Оусень", "День Дмитрия Основателя." };
            string[] ac341 = new string[SIZE] { "Тайлѣтъ", "9", "17", "Оусень", "" };
            string[] ac342 = new string[SIZE] { "Тайлѣтъ", "9", "18", "Оусень", "День Стрибога. Почитание Бога, управляющего ветрами." };
            string[] ac343 = new string[SIZE] { "Тайлѣтъ", "9", "19", "Оусень", "" };
            string[] ac344 = new string[SIZE] { "Тайлѣтъ", "9", "20", "Оусень", "" };
            string[] ac345 = new string[SIZE] { "Тайлѣтъ", "9", "21", "Оусень", "Златогорка." };
            string[] ac346 = new string[SIZE] { "Тайлѣтъ", "9", "22", "Оусень", "Любомир. День Свадеб." };
            string[] ac347 = new string[SIZE] { "Тайлѣтъ", "9", "23", "Оусень", "" };
            string[] ac348 = new string[SIZE] { "Тайлѣтъ", "9", "24", "Оусень", "День Свентослава Асгардского." };
            string[] ac349 = new string[SIZE] { "Тайлѣтъ", "9", "25", "Оусень", "" };
            string[] ac350 = new string[SIZE] { "Тайлѣтъ", "9", "26", "Оусень", "" };
            string[] ac351 = new string[SIZE] { "Тайлѣтъ", "9", "27", "Оусень", "День Джива-Инта. Время Очищения и Преображения." };
            string[] ac352 = new string[SIZE] { "Тайлѣтъ", "9", "28", "Оусень", "" };
            string[] ac353 = new string[SIZE] { "Тайлѣтъ", "9", "29", "Оусень", "День Жели." };
            string[] ac354 = new string[SIZE] { "Тайлѣтъ", "9", "30", "Оусень", "" };
            string[] ac355 = new string[SIZE] { "Тайлѣтъ", "9", "31", "Оусень", "День Святослава Праведного." };
            string[] ac356 = new string[SIZE] { "Тайлѣтъ", "9", "32", "Оусень", "" };
            string[] ac357 = new string[SIZE] { "Тайлѣтъ", "9", "33", "Оусень", "Сеченник." };
            string[] ac358 = new string[SIZE] { "Тайлѣтъ", "9", "34", "Оусень", "" };
            string[] ac359 = new string[SIZE] { "Тайлѣтъ", "9", "35", "Оусень", "День Богини Карны. День почитания Богини Карны (сестры Жели). Она отвечает за перерождение Душ в Явном мире, которые не исполнили свой Долг." };
            string[] ac360 = new string[SIZE] { "Тайлѣтъ", "9", "36", "Оусень", "" };
            string[] ac361 = new string[SIZE] { "Тайлѣтъ", "9", "37", "Оусень", "" };
            string[] ac362 = new string[SIZE] { "Тайлѣтъ", "9", "38", "Оусень", "День Светозара Странника." };
            string[] ac363 = new string[SIZE] { "Тайлѣтъ", "9", "39", "Оусень", "" };
            string[] ac364 = new string[SIZE] { "Тайлѣтъ", "9", "40", "Оусень", "" };
            string[] ac365 = new string[SIZE] { "Тайлѣтъ", "9", "41", "Оусень", "День Александра Вещего." };

            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 9 && bday == 23) ac = ac1;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 9 && bday == 24) ac = ac2;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 9 && bday == 25) ac = ac3;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 9 && bday == 26) ac = ac4;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 9 && bday == 27) ac = ac5;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 9 && bday == 28) ac = ac6;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 9 && bday == 29) ac = ac7;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 9 && bday == 30) ac = ac8;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 10 && bday == 1) ac = ac9;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 10 && bday == 2) ac = ac10;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 10 && bday == 3) ac = ac11;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 10 && bday == 4) ac = ac12;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 10 && bday == 5) ac = ac13;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 10 && bday == 6) ac = ac14;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 10 && bday == 7) ac = ac15;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 10 && bday == 8) ac = ac16;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 10 && bday == 9) ac = ac17;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 10 && bday == 10) ac = ac18;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 10 && bday == 11) ac = ac19;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 10 && bday == 12) ac = ac20;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 10 && bday == 13) ac = ac21;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 10 && bday == 14) ac = ac22;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 10 && bday == 15) ac = ac23;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 10 && bday == 16) ac = ac24;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 10 && bday == 17) ac = ac25;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 10 && bday == 18) ac = ac26;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 10 && bday == 19) ac = ac27;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 10 && bday == 20) ac = ac28;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 10 && bday == 21) ac = ac29;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 10 && bday == 22) ac = ac30;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 10 && bday == 23) ac = ac31;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 10 && bday == 24) ac = ac32;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 10 && bday == 25) ac = ac33;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 10 && bday == 26) ac = ac34;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 10 && bday == 27) ac = ac35;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 10 && bday == 28) ac = ac36;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 10 && bday == 29) ac = ac37;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 10 && bday == 30) ac = ac38;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 10 && bday == 31) ac = ac39;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 11 && bday == 1) ac = ac40;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 11 && bday == 2) ac = ac41;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 11 && bday == 3) ac = ac42;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 11 && bday == 4) ac = ac43;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 11 && bday == 5) ac = ac44;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 11 && bday == 6) ac = ac45;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 11 && bday == 7) ac = ac46;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 11 && bday == 8) ac = ac47;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 11 && bday == 9) ac = ac48;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 11 && bday == 10) ac = ac49;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 11 && bday == 11) ac = ac50;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 11 && bday == 12) ac = ac51;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 11 && bday == 13) ac = ac52;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 11 && bday == 14) ac = ac53;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 11 && bday == 15) ac = ac54;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 11 && bday == 16) ac = ac55;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 11 && bday == 17) ac = ac56;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 11 && bday == 18) ac = ac57;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 11 && bday == 19) ac = ac58;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 11 && bday == 20) ac = ac59;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 11 && bday == 21) ac = ac60;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 11 && bday == 22) ac = ac61;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 11 && bday == 23) ac = ac62;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 11 && bday == 24) ac = ac63;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 11 && bday == 25) ac = ac64;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 11 && bday == 26) ac = ac65;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 11 && bday == 27) ac = ac66;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 11 && bday == 28) ac = ac67;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 11 && bday == 29) ac = ac68;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 11 && bday == 30) ac = ac69;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 12 && bday == 1) ac = ac70;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 12 && bday == 2) ac = ac71;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 12 && bday == 3) ac = ac72;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 12 && bday == 4) ac = ac73;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 12 && bday == 5) ac = ac74;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 12 && bday == 6) ac = ac75;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 12 && bday == 7) ac = ac76;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 12 && bday == 8) ac = ac77;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 12 && bday == 9) ac = ac78;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 12 && bday == 10) ac = ac79;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 12 && bday == 11) ac = ac80;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 12 && bday == 12) ac = ac81;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 12 && bday == 13) ac = ac82;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 12 && bday == 14) ac = ac83;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 12 && bday == 15) ac = ac84;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 12 && bday == 16) ac = ac85;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 12 && bday == 17) ac = ac86;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 12 && bday == 18) ac = ac87;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 12 && bday == 19) ac = ac88;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 12 && bday == 20) ac = ac89;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 12 && bday == 21) ac = ac90;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 12 && bday == 22) ac = ac91;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 12 && bday == 23) ac = ac92;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 12 && bday == 24) ac = ac93;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 12 && bday == 25) ac = ac94;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 12 && bday == 26) ac = ac95;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 12 && bday == 27) ac = ac96;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 12 && bday == 28) ac = ac97;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 12 && bday == 29) ac = ac98;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 12 && bday == 30) ac = ac99;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 12 && bday == 31) ac = ac100;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 1 && bday == 1) ac = ac101;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 1 && bday == 2) ac = ac102;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 1 && bday == 3) ac = ac103;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 1 && bday == 4) ac = ac104;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 1 && bday == 5) ac = ac105;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 1 && bday == 6) ac = ac106;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 1 && bday == 7) ac = ac107;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 1 && bday == 8) ac = ac108;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 1 && bday == 9) ac = ac109;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 1 && bday == 10) ac = ac110;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 1 && bday == 11) ac = ac111;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 1 && bday == 12) ac = ac112;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 1 && bday == 13) ac = ac113;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 1 && bday == 14) ac = ac114;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 1 && bday == 15) ac = ac115;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 1 && bday == 16) ac = ac116;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 1 && bday == 17) ac = ac117;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 1 && bday == 18) ac = ac118;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 1 && bday == 19) ac = ac119;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 1 && bday == 20) ac = ac120;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 1 && bday == 21) ac = ac121;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 1 && bday == 22) ac = ac122;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 1 && bday == 23) ac = ac123;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 1 && bday == 24) ac = ac124;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 1 && bday == 25) ac = ac125;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 1 && bday == 26) ac = ac126;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 1 && bday == 27) ac = ac127;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 1 && bday == 28) ac = ac128;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 1 && bday == 29) ac = ac129;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 1 && bday == 30) ac = ac130;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 1 && bday == 31) ac = ac131;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 2 && bday == 1) ac = ac132;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 2 && bday == 2) ac = ac133;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 2 && bday == 3) ac = ac134;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 2 && bday == 4) ac = ac135;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 2 && bday == 5) ac = ac136;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 2 && bday == 6) ac = ac137;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 2 && bday == 7) ac = ac138;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 2 && bday == 8) ac = ac139;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 2 && bday == 9) ac = ac140;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 2 && bday == 10) ac = ac141;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 2 && bday == 11) ac = ac142;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 2 && bday == 12) ac = ac143;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 2 && bday == 13) ac = ac144;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 2 && bday == 14) ac = ac145;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 2 && bday == 15) ac = ac146;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 2 && bday == 16) ac = ac147;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 2 && bday == 17) ac = ac148;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 2 && bday == 18) ac = ac149;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 2 && bday == 19) ac = ac150;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 2 && bday == 20) ac = ac151;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 2 && bday == 21) ac = ac152;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 2 && bday == 22) ac = ac153;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 2 && bday == 23) ac = ac154;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 2 && bday == 24) ac = ac155;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 2 && bday == 25) ac = ac156;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 2 && bday == 26) ac = ac157;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 2 && bday == 27) ac = ac158;
            if ((abbb == 1 || abbb == 2 || abbb == 3 || abbb == 4) && bmonth == 2 && bday == 28) ac = ac159;
            if ((abbb == 4) && bmonth == 2 && bday == 29) ac = ac160;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 3 && bday == 1) ac = ac160;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 3 && bday == 2) ac = ac161;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 3 && bday == 3) ac = ac162;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 3 && bday == 4) ac = ac163;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 3 && bday == 5) ac = ac164;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 3 && bday == 6) ac = ac165;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 3 && bday == 7) ac = ac166;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 3 && bday == 8) ac = ac167;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 3 && bday == 9) ac = ac168;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 3 && bday == 10) ac = ac169;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 3 && bday == 11) ac = ac170;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 3 && bday == 12) ac = ac171;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 3 && bday == 13) ac = ac172;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 3 && bday == 14) ac = ac173;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 3 && bday == 15) ac = ac174;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 3 && bday == 16) ac = ac175;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 3 && bday == 17) ac = ac176;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 3 && bday == 18) ac = ac177;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 3 && bday == 19) ac = ac178;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 3 && bday == 20) ac = ac179;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 3 && bday == 21) ac = ac180;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 3 && bday == 22) ac = ac181;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 3 && bday == 23) ac = ac182;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 3 && bday == 24) ac = ac183;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 3 && bday == 25) ac = ac184;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 3 && bday == 26) ac = ac185;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 3 && bday == 27) ac = ac186;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 3 && bday == 28) ac = ac187;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 3 && bday == 29) ac = ac188;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 3 && bday == 30) ac = ac189;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 3 && bday == 31) ac = ac190;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 4 && bday == 1) ac = ac191;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 4 && bday == 2) ac = ac192;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 4 && bday == 3) ac = ac193;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 4 && bday == 4) ac = ac194;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 4 && bday == 5) ac = ac195;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 4 && bday == 6) ac = ac196;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 4 && bday == 7) ac = ac197;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 4 && bday == 8) ac = ac198;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 4 && bday == 9) ac = ac199;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 4 && bday == 10) ac = ac200;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 4 && bday == 11) ac = ac201;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 4 && bday == 12) ac = ac202;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 4 && bday == 13) ac = ac203;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 4 && bday == 14) ac = ac204;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 4 && bday == 15) ac = ac205;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 4 && bday == 16) ac = ac206;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 4 && bday == 17) ac = ac207;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 4 && bday == 18) ac = ac208;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 4 && bday == 19) ac = ac209;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 4 && bday == 20) ac = ac210;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 4 && bday == 21) ac = ac211;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 4 && bday == 22) ac = ac212;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 4 && bday == 23) ac = ac213;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 4 && bday == 24) ac = ac214;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 4 && bday == 25) ac = ac215;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 4 && bday == 26) ac = ac216;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 4 && bday == 27) ac = ac217;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 4 && bday == 28) ac = ac218;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 4 && bday == 29) ac = ac219;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 4 && bday == 30) ac = ac220;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 5 && bday == 1) ac = ac221;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 5 && bday == 2) ac = ac222;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 5 && bday == 3) ac = ac223;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 5 && bday == 4) ac = ac224;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 5 && bday == 5) ac = ac225;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 5 && bday == 6) ac = ac226;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 5 && bday == 7) ac = ac227;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 5 && bday == 8) ac = ac228;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 5 && bday == 9) ac = ac229;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 5 && bday == 10) ac = ac230;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 5 && bday == 11) ac = ac231;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 5 && bday == 12) ac = ac232;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 5 && bday == 13) ac = ac233;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 5 && bday == 14) ac = ac234;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 5 && bday == 15) ac = ac235;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 5 && bday == 16) ac = ac236;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 5 && bday == 17) ac = ac237;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 5 && bday == 18) ac = ac238;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 5 && bday == 19) ac = ac239;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 5 && bday == 20) ac = ac240;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 5 && bday == 21) ac = ac241;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 5 && bday == 22) ac = ac242;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 5 && bday == 23) ac = ac243;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 5 && bday == 24) ac = ac244;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 5 && bday == 25) ac = ac245;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 5 && bday == 26) ac = ac246;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 5 && bday == 27) ac = ac247;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 5 && bday == 28) ac = ac248;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 5 && bday == 29) ac = ac249;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 5 && bday == 30) ac = ac250;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 5 && bday == 31) ac = ac251;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 6 && bday == 1) ac = ac252;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 6 && bday == 2) ac = ac253;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 6 && bday == 3) ac = ac254;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 6 && bday == 4) ac = ac255;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 6 && bday == 5) ac = ac256;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 6 && bday == 6) ac = ac257;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 6 && bday == 7) ac = ac258;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 6 && bday == 8) ac = ac259;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 6 && bday == 9) ac = ac260;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 6 && bday == 10) ac = ac261;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 6 && bday == 11) ac = ac262;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 6 && bday == 12) ac = ac263;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 6 && bday == 13) ac = ac264;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 6 && bday == 14) ac = ac265;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 6 && bday == 15) ac = ac266;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 6 && bday == 16) ac = ac267;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 6 && bday == 17) ac = ac268;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 6 && bday == 18) ac = ac269;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 6 && bday == 19) ac = ac270;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 6 && bday == 20) ac = ac271;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 6 && bday == 21) ac = ac272;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 6 && bday == 22) ac = ac273;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 6 && bday == 23) ac = ac274;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 6 && bday == 24) ac = ac275;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 6 && bday == 25) ac = ac276;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 6 && bday == 26) ac = ac277;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 6 && bday == 27) ac = ac278;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 6 && bday == 28) ac = ac279;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 6 && bday == 29) ac = ac280;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 6 && bday == 30) ac = ac281;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 7 && bday == 1) ac = ac282;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 7 && bday == 2) ac = ac283;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 7 && bday == 3) ac = ac284;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 7 && bday == 4) ac = ac285;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 7 && bday == 5) ac = ac286;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 7 && bday == 6) ac = ac287;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 7 && bday == 7) ac = ac288;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 7 && bday == 8) ac = ac289;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 7 && bday == 9) ac = ac290;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 7 && bday == 10) ac = ac291;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 7 && bday == 11) ac = ac292;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 7 && bday == 12) ac = ac293;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 7 && bday == 13) ac = ac294;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 7 && bday == 14) ac = ac295;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 7 && bday == 15) ac = ac296;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 7 && bday == 16) ac = ac297;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 7 && bday == 17) ac = ac298;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 7 && bday == 18) ac = ac299;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 7 && bday == 19) ac = ac300;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 7 && bday == 20) ac = ac301;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 7 && bday == 21) ac = ac302;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 7 && bday == 22) ac = ac303;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 7 && bday == 23) ac = ac304;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 7 && bday == 24) ac = ac305;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 7 && bday == 25) ac = ac306;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 7 && bday == 26) ac = ac307;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 7 && bday == 27) ac = ac308;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 7 && bday == 28) ac = ac309;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 7 && bday == 29) ac = ac310;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 7 && bday == 30) ac = ac311;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 7 && bday == 31) ac = ac312;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 8 && bday == 1) ac = ac313;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 8 && bday == 2) ac = ac314;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 8 && bday == 3) ac = ac315;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 8 && bday == 4) ac = ac316;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 8 && bday == 5) ac = ac317;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 8 && bday == 6) ac = ac318;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 8 && bday == 7) ac = ac319;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 8 && bday == 8) ac = ac320;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 8 && bday == 9) ac = ac321;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 8 && bday == 10) ac = ac322;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 8 && bday == 11) ac = ac323;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 8 && bday == 12) ac = ac324;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 8 && bday == 13) ac = ac325;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 8 && bday == 14) ac = ac326;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 8 && bday == 15) ac = ac327;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 8 && bday == 16) ac = ac328;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 8 && bday == 17) ac = ac329;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 8 && bday == 18) ac = ac330;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 8 && bday == 19) ac = ac331;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 8 && bday == 20) ac = ac332;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 8 && bday == 21) ac = ac333;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 8 && bday == 22) ac = ac334;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 8 && bday == 23) ac = ac335;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 8 && bday == 24) ac = ac336;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 8 && bday == 25) ac = ac337;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 8 && bday == 26) ac = ac338;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 8 && bday == 27) ac = ac339;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 8 && bday == 28) ac = ac340;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 8 && bday == 29) ac = ac341;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 8 && bday == 30) ac = ac342;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 8 && bday == 31) ac = ac343;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 9 && bday == 1) ac = ac344;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 9 && bday == 2) ac = ac345;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 9 && bday == 3) ac = ac346;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 9 && bday == 4) ac = ac347;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 9 && bday == 5) ac = ac348;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 9 && bday == 6) ac = ac349;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 9 && bday == 7) ac = ac350;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 9 && bday == 8) ac = ac351;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 9 && bday == 9) ac = ac352;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 9 && bday == 10) ac = ac353;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 9 && bday == 11) ac = ac354;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 9 && bday == 12) ac = ac355;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 9 && bday == 13) ac = ac356;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 9 && bday == 14) ac = ac357;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 9 && bday == 15) ac = ac358;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 9 && bday == 16) ac = ac359;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 9 && bday == 17) ac = ac360;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 9 && bday == 18) ac = ac361;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 9 && bday == 19) ac = ac362;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 9 && bday == 20) ac = ac363;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 9 && bday == 21) ac = ac364;
            if ((abbb == 1 || abbb == 2 || abbb == 3) && bmonth == 9 && bday == 22) ac = ac365;
            //5,6,7		
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 9 && bday == 22) ac = ac1;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 9 && bday == 23) ac = ac2;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 9 && bday == 24) ac = ac3;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 9 && bday == 25) ac = ac4;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 9 && bday == 26) ac = ac5;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 9 && bday == 27) ac = ac6;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 9 && bday == 28) ac = ac7;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 9 && bday == 29) ac = ac8;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 9 && bday == 30) ac = ac9;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 10 && bday == 1) ac = ac10;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 10 && bday == 2) ac = ac11;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 10 && bday == 3) ac = ac12;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 10 && bday == 4) ac = ac13;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 10 && bday == 5) ac = ac14;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 10 && bday == 6) ac = ac15;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 10 && bday == 7) ac = ac16;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 10 && bday == 8) ac = ac17;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 10 && bday == 9) ac = ac18;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 10 && bday == 10) ac = ac19;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 10 && bday == 11) ac = ac20;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 10 && bday == 12) ac = ac21;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 10 && bday == 13) ac = ac22;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 10 && bday == 14) ac = ac23;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 10 && bday == 15) ac = ac24;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 10 && bday == 16) ac = ac25;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 10 && bday == 17) ac = ac26;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 10 && bday == 18) ac = ac27;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 10 && bday == 19) ac = ac28;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 10 && bday == 20) ac = ac29;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 10 && bday == 21) ac = ac30;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 10 && bday == 22) ac = ac31;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 10 && bday == 23) ac = ac32;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 10 && bday == 24) ac = ac33;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 10 && bday == 25) ac = ac34;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 10 && bday == 26) ac = ac35;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 10 && bday == 27) ac = ac36;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 10 && bday == 28) ac = ac37;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 10 && bday == 29) ac = ac38;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 10 && bday == 30) ac = ac39;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 10 && bday == 31) ac = ac40;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 11 && bday == 1) ac = ac41;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 11 && bday == 2) ac = ac42;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 11 && bday == 3) ac = ac43;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 11 && bday == 4) ac = ac44;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 11 && bday == 5) ac = ac45;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 11 && bday == 6) ac = ac46;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 11 && bday == 7) ac = ac47;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 11 && bday == 8) ac = ac48;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 11 && bday == 9) ac = ac49;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 11 && bday == 10) ac = ac50;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 11 && bday == 11) ac = ac51;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 11 && bday == 12) ac = ac52;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 11 && bday == 13) ac = ac53;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 11 && bday == 14) ac = ac54;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 11 && bday == 15) ac = ac55;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 11 && bday == 16) ac = ac56;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 11 && bday == 17) ac = ac57;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 11 && bday == 18) ac = ac58;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 11 && bday == 19) ac = ac59;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 11 && bday == 20) ac = ac60;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 11 && bday == 21) ac = ac61;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 11 && bday == 22) ac = ac62;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 11 && bday == 23) ac = ac63;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 11 && bday == 24) ac = ac64;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 11 && bday == 25) ac = ac65;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 11 && bday == 26) ac = ac66;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 11 && bday == 27) ac = ac67;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 11 && bday == 28) ac = ac68;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 11 && bday == 29) ac = ac69;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 11 && bday == 30) ac = ac70;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 12 && bday == 1) ac = ac71;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 12 && bday == 2) ac = ac72;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 12 && bday == 3) ac = ac73;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 12 && bday == 4) ac = ac74;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 12 && bday == 5) ac = ac75;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 12 && bday == 6) ac = ac76;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 12 && bday == 7) ac = ac77;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 12 && bday == 8) ac = ac78;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 12 && bday == 9) ac = ac79;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 12 && bday == 10) ac = ac80;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 12 && bday == 11) ac = ac81;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 12 && bday == 12) ac = ac82;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 12 && bday == 13) ac = ac83;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 12 && bday == 14) ac = ac84;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 12 && bday == 15) ac = ac85;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 12 && bday == 16) ac = ac86;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 12 && bday == 17) ac = ac87;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 12 && bday == 18) ac = ac88;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 12 && bday == 19) ac = ac89;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 12 && bday == 20) ac = ac90;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 12 && bday == 21) ac = ac91;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 12 && bday == 22) ac = ac92;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 12 && bday == 23) ac = ac93;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 12 && bday == 24) ac = ac94;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 12 && bday == 25) ac = ac95;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 12 && bday == 26) ac = ac96;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 12 && bday == 27) ac = ac97;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 12 && bday == 28) ac = ac98;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 12 && bday == 29) ac = ac99;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 12 && bday == 30) ac = ac100;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 12 && bday == 31) ac = ac101;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 1 && bday == 1) ac = ac102;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 1 && bday == 2) ac = ac103;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 1 && bday == 3) ac = ac104;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 1 && bday == 4) ac = ac105;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 1 && bday == 5) ac = ac106;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 1 && bday == 6) ac = ac107;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 1 && bday == 7) ac = ac108;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 1 && bday == 8) ac = ac109;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 1 && bday == 9) ac = ac110;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 1 && bday == 10) ac = ac111;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 1 && bday == 11) ac = ac112;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 1 && bday == 12) ac = ac113;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 1 && bday == 13) ac = ac114;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 1 && bday == 14) ac = ac115;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 1 && bday == 15) ac = ac116;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 1 && bday == 16) ac = ac117;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 1 && bday == 17) ac = ac118;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 1 && bday == 18) ac = ac119;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 1 && bday == 19) ac = ac120;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 1 && bday == 20) ac = ac121;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 1 && bday == 21) ac = ac122;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 1 && bday == 22) ac = ac123;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 1 && bday == 23) ac = ac124;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 1 && bday == 24) ac = ac125;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 1 && bday == 25) ac = ac126;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 1 && bday == 26) ac = ac127;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 1 && bday == 27) ac = ac128;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 1 && bday == 28) ac = ac129;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 1 && bday == 29) ac = ac130;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 1 && bday == 30) ac = ac131;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 1 && bday == 31) ac = ac132;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 2 && bday == 1) ac = ac133;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 2 && bday == 2) ac = ac134;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 2 && bday == 3) ac = ac135;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 2 && bday == 4) ac = ac136;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 2 && bday == 5) ac = ac137;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 2 && bday == 6) ac = ac138;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 2 && bday == 7) ac = ac139;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 2 && bday == 8) ac = ac140;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 2 && bday == 9) ac = ac141;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 2 && bday == 10) ac = ac142;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 2 && bday == 11) ac = ac143;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 2 && bday == 12) ac = ac144;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 2 && bday == 13) ac = ac145;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 2 && bday == 14) ac = ac146;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 2 && bday == 15) ac = ac147;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 2 && bday == 16) ac = ac148;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 2 && bday == 17) ac = ac149;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 2 && bday == 18) ac = ac150;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 2 && bday == 19) ac = ac151;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 2 && bday == 20) ac = ac152;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 2 && bday == 21) ac = ac153;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 2 && bday == 22) ac = ac154;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 2 && bday == 23) ac = ac155;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 2 && bday == 24) ac = ac156;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 2 && bday == 25) ac = ac157;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 2 && bday == 26) ac = ac158;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 2 && bday == 27) ac = ac159;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 8) && bmonth == 2 && bday == 28) ac = ac160;
            if ((abbb == 8) && bmonth == 2 && bday == 29) ac = ac161;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 3 && bday == 1) ac = ac161;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 3 && bday == 2) ac = ac162;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 3 && bday == 3) ac = ac163;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 3 && bday == 4) ac = ac164;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 3 && bday == 5) ac = ac165;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 3 && bday == 6) ac = ac166;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 3 && bday == 7) ac = ac167;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 3 && bday == 8) ac = ac168;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 3 && bday == 9) ac = ac169;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 3 && bday == 10) ac = ac170;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 3 && bday == 11) ac = ac171;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 3 && bday == 12) ac = ac172;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 3 && bday == 13) ac = ac173;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 3 && bday == 14) ac = ac174;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 3 && bday == 15) ac = ac175;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 3 && bday == 16) ac = ac176;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 3 && bday == 17) ac = ac177;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 3 && bday == 18) ac = ac178;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 3 && bday == 19) ac = ac179;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 3 && bday == 20) ac = ac180;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 3 && bday == 21) ac = ac181;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 3 && bday == 22) ac = ac182;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 3 && bday == 23) ac = ac183;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 3 && bday == 24) ac = ac184;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 3 && bday == 25) ac = ac185;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 3 && bday == 26) ac = ac186;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 3 && bday == 27) ac = ac187;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 3 && bday == 28) ac = ac188;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 3 && bday == 29) ac = ac189;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 3 && bday == 30) ac = ac190;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 3 && bday == 31) ac = ac191;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 4 && bday == 1) ac = ac192;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 4 && bday == 2) ac = ac193;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 4 && bday == 3) ac = ac194;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 4 && bday == 4) ac = ac195;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 4 && bday == 5) ac = ac196;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 4 && bday == 6) ac = ac197;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 4 && bday == 7) ac = ac198;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 4 && bday == 8) ac = ac199;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 4 && bday == 9) ac = ac200;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 4 && bday == 10) ac = ac201;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 4 && bday == 11) ac = ac202;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 4 && bday == 12) ac = ac203;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 4 && bday == 13) ac = ac204;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 4 && bday == 14) ac = ac205;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 4 && bday == 15) ac = ac206;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 4 && bday == 16) ac = ac207;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 4 && bday == 17) ac = ac208;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 4 && bday == 18) ac = ac209;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 4 && bday == 19) ac = ac210;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 4 && bday == 20) ac = ac211;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 4 && bday == 21) ac = ac212;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 4 && bday == 22) ac = ac213;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 4 && bday == 23) ac = ac214;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 4 && bday == 24) ac = ac215;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 4 && bday == 25) ac = ac216;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 4 && bday == 26) ac = ac217;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 4 && bday == 27) ac = ac218;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 4 && bday == 28) ac = ac219;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 4 && bday == 29) ac = ac220;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 4 && bday == 30) ac = ac221;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 5 && bday == 1) ac = ac222;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 5 && bday == 2) ac = ac223;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 5 && bday == 3) ac = ac224;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 5 && bday == 4) ac = ac225;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 5 && bday == 5) ac = ac226;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 5 && bday == 6) ac = ac227;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 5 && bday == 7) ac = ac228;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 5 && bday == 8) ac = ac229;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 5 && bday == 9) ac = ac230;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 5 && bday == 10) ac = ac231;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 5 && bday == 11) ac = ac232;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 5 && bday == 12) ac = ac233;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 5 && bday == 13) ac = ac234;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 5 && bday == 14) ac = ac235;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 5 && bday == 15) ac = ac236;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 5 && bday == 16) ac = ac237;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 5 && bday == 17) ac = ac238;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 5 && bday == 18) ac = ac239;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 5 && bday == 19) ac = ac240;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 5 && bday == 20) ac = ac241;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 5 && bday == 21) ac = ac242;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 5 && bday == 22) ac = ac243;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 5 && bday == 23) ac = ac244;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 5 && bday == 24) ac = ac245;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 5 && bday == 25) ac = ac246;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 5 && bday == 26) ac = ac247;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 5 && bday == 27) ac = ac248;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 5 && bday == 28) ac = ac249;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 5 && bday == 29) ac = ac250;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 5 && bday == 30) ac = ac251;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 5 && bday == 31) ac = ac252;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 6 && bday == 1) ac = ac253;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 6 && bday == 2) ac = ac254;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 6 && bday == 3) ac = ac255;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 6 && bday == 4) ac = ac256;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 6 && bday == 5) ac = ac257;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 6 && bday == 6) ac = ac258;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 6 && bday == 7) ac = ac259;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 6 && bday == 8) ac = ac260;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 6 && bday == 9) ac = ac261;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 6 && bday == 10) ac = ac262;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 6 && bday == 11) ac = ac263;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 6 && bday == 12) ac = ac264;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 6 && bday == 13) ac = ac265;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 6 && bday == 14) ac = ac266;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 6 && bday == 15) ac = ac267;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 6 && bday == 16) ac = ac268;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 6 && bday == 17) ac = ac269;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 6 && bday == 18) ac = ac270;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 6 && bday == 19) ac = ac271;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 6 && bday == 20) ac = ac272;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 6 && bday == 21) ac = ac273;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 6 && bday == 22) ac = ac274;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 6 && bday == 23) ac = ac275;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 6 && bday == 24) ac = ac276;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 6 && bday == 25) ac = ac277;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 6 && bday == 26) ac = ac278;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 6 && bday == 27) ac = ac279;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 6 && bday == 28) ac = ac280;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 6 && bday == 29) ac = ac281;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 6 && bday == 30) ac = ac282;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 7 && bday == 1) ac = ac283;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 7 && bday == 2) ac = ac284;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 7 && bday == 3) ac = ac285;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 7 && bday == 4) ac = ac286;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 7 && bday == 5) ac = ac287;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 7 && bday == 6) ac = ac288;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 7 && bday == 7) ac = ac289;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 7 && bday == 8) ac = ac290;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 7 && bday == 9) ac = ac291;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 7 && bday == 10) ac = ac292;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 7 && bday == 11) ac = ac293;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 7 && bday == 12) ac = ac294;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 7 && bday == 13) ac = ac295;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 7 && bday == 14) ac = ac296;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 7 && bday == 15) ac = ac297;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 7 && bday == 16) ac = ac298;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 7 && bday == 17) ac = ac299;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 7 && bday == 18) ac = ac300;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 7 && bday == 19) ac = ac301;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 7 && bday == 20) ac = ac302;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 7 && bday == 21) ac = ac303;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 7 && bday == 22) ac = ac304;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 7 && bday == 23) ac = ac305;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 7 && bday == 24) ac = ac306;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 7 && bday == 25) ac = ac307;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 7 && bday == 26) ac = ac308;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 7 && bday == 27) ac = ac309;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 7 && bday == 28) ac = ac310;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 7 && bday == 29) ac = ac311;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 7 && bday == 30) ac = ac312;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 7 && bday == 31) ac = ac313;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 8 && bday == 1) ac = ac314;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 8 && bday == 2) ac = ac315;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 8 && bday == 3) ac = ac316;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 8 && bday == 4) ac = ac317;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 8 && bday == 5) ac = ac318;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 8 && bday == 6) ac = ac319;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 8 && bday == 7) ac = ac320;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 8 && bday == 8) ac = ac321;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 8 && bday == 9) ac = ac322;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 8 && bday == 10) ac = ac323;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 8 && bday == 11) ac = ac324;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 8 && bday == 12) ac = ac325;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 8 && bday == 13) ac = ac326;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 8 && bday == 14) ac = ac327;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 8 && bday == 15) ac = ac328;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 8 && bday == 16) ac = ac329;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 8 && bday == 17) ac = ac330;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 8 && bday == 18) ac = ac331;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 8 && bday == 19) ac = ac332;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 8 && bday == 20) ac = ac333;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 8 && bday == 21) ac = ac334;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 8 && bday == 22) ac = ac335;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 8 && bday == 23) ac = ac336;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 8 && bday == 24) ac = ac337;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 8 && bday == 25) ac = ac338;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 8 && bday == 26) ac = ac339;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 8 && bday == 27) ac = ac340;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 8 && bday == 28) ac = ac341;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 8 && bday == 29) ac = ac342;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 8 && bday == 30) ac = ac343;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 8 && bday == 31) ac = ac344;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 9 && bday == 1) ac = ac345;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 9 && bday == 2) ac = ac346;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 9 && bday == 3) ac = ac347;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 9 && bday == 4) ac = ac348;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 9 && bday == 5) ac = ac349;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 9 && bday == 6) ac = ac350;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 9 && bday == 7) ac = ac351;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 9 && bday == 8) ac = ac352;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 9 && bday == 9) ac = ac353;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 9 && bday == 10) ac = ac354;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 9 && bday == 11) ac = ac355;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 9 && bday == 12) ac = ac356;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 9 && bday == 13) ac = ac357;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 9 && bday == 14) ac = ac358;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 9 && bday == 15) ac = ac359;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 9 && bday == 16) ac = ac360;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 9 && bday == 17) ac = ac361;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 9 && bday == 18) ac = ac362;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 9 && bday == 19) ac = ac363;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 9 && bday == 20) ac = ac364;
            if ((abbb == 5 || abbb == 6 || abbb == 7 || abbb == 4) && bmonth == 9 && bday == 21) ac = ac365;
            //9,10,11		
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 9 && bday == 21) ac = ac1;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 9 && bday == 22) ac = ac2;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 9 && bday == 23) ac = ac3;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 9 && bday == 24) ac = ac4;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 9 && bday == 25) ac = ac5;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 9 && bday == 26) ac = ac6;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 9 && bday == 27) ac = ac7;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 9 && bday == 28) ac = ac8;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 9 && bday == 29) ac = ac9;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 9 && bday == 30) ac = ac10;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 10 && bday == 1) ac = ac11;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 10 && bday == 2) ac = ac12;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 10 && bday == 3) ac = ac13;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 10 && bday == 4) ac = ac14;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 10 && bday == 5) ac = ac15;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 10 && bday == 6) ac = ac16;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 10 && bday == 7) ac = ac17;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 10 && bday == 8) ac = ac18;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 10 && bday == 9) ac = ac19;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 10 && bday == 10) ac = ac20;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 10 && bday == 11) ac = ac21;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 10 && bday == 12) ac = ac22;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 10 && bday == 13) ac = ac23;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 10 && bday == 14) ac = ac24;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 10 && bday == 15) ac = ac25;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 10 && bday == 16) ac = ac26;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 10 && bday == 17) ac = ac27;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 10 && bday == 18) ac = ac28;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 10 && bday == 19) ac = ac29;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 10 && bday == 20) ac = ac30;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 10 && bday == 21) ac = ac31;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 10 && bday == 22) ac = ac32;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 10 && bday == 23) ac = ac33;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 10 && bday == 24) ac = ac34;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 10 && bday == 25) ac = ac35;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 10 && bday == 26) ac = ac36;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 10 && bday == 27) ac = ac37;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 10 && bday == 28) ac = ac38;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 10 && bday == 29) ac = ac39;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 10 && bday == 30) ac = ac40;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 10 && bday == 31) ac = ac41;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 11 && bday == 1) ac = ac42;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 11 && bday == 2) ac = ac43;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 11 && bday == 3) ac = ac44;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 11 && bday == 4) ac = ac45;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 11 && bday == 5) ac = ac46;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 11 && bday == 6) ac = ac47;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 11 && bday == 7) ac = ac48;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 11 && bday == 8) ac = ac49;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 11 && bday == 9) ac = ac50;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 11 && bday == 10) ac = ac51;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 11 && bday == 11) ac = ac52;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 11 && bday == 12) ac = ac53;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 11 && bday == 13) ac = ac54;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 11 && bday == 14) ac = ac55;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 11 && bday == 15) ac = ac56;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 11 && bday == 16) ac = ac57;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 11 && bday == 17) ac = ac58;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 11 && bday == 18) ac = ac59;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 11 && bday == 19) ac = ac60;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 11 && bday == 20) ac = ac61;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 11 && bday == 21) ac = ac62;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 11 && bday == 22) ac = ac63;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 11 && bday == 23) ac = ac64;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 11 && bday == 24) ac = ac65;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 11 && bday == 25) ac = ac66;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 11 && bday == 26) ac = ac67;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 11 && bday == 27) ac = ac68;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 11 && bday == 28) ac = ac69;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 11 && bday == 29) ac = ac70;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 11 && bday == 30) ac = ac71;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 12 && bday == 1) ac = ac72;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 12 && bday == 2) ac = ac73;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 12 && bday == 3) ac = ac74;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 12 && bday == 4) ac = ac75;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 12 && bday == 5) ac = ac76;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 12 && bday == 6) ac = ac77;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 12 && bday == 7) ac = ac78;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 12 && bday == 8) ac = ac79;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 12 && bday == 9) ac = ac80;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 12 && bday == 10) ac = ac81;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 12 && bday == 11) ac = ac82;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 12 && bday == 12) ac = ac83;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 12 && bday == 13) ac = ac84;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 12 && bday == 14) ac = ac85;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 12 && bday == 15) ac = ac86;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 12 && bday == 16) ac = ac87;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 12 && bday == 17) ac = ac88;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 12 && bday == 18) ac = ac89;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 12 && bday == 19) ac = ac90;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 12 && bday == 20) ac = ac91;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 12 && bday == 21) ac = ac92;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 12 && bday == 22) ac = ac93;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 12 && bday == 23) ac = ac94;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 12 && bday == 24) ac = ac95;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 12 && bday == 25) ac = ac96;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 12 && bday == 26) ac = ac97;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 12 && bday == 27) ac = ac98;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 12 && bday == 28) ac = ac99;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 12 && bday == 29) ac = ac100;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 12 && bday == 30) ac = ac101;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 12 && bday == 31) ac = ac102;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 1 && bday == 1) ac = ac103;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 1 && bday == 2) ac = ac104;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 1 && bday == 3) ac = ac105;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 1 && bday == 4) ac = ac106;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 1 && bday == 5) ac = ac107;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 1 && bday == 6) ac = ac108;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 1 && bday == 7) ac = ac109;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 1 && bday == 8) ac = ac110;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 1 && bday == 9) ac = ac111;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 1 && bday == 10) ac = ac112;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 1 && bday == 11) ac = ac113;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 1 && bday == 12) ac = ac114;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 1 && bday == 13) ac = ac115;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 1 && bday == 14) ac = ac116;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 1 && bday == 15) ac = ac117;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 1 && bday == 16) ac = ac118;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 1 && bday == 17) ac = ac119;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 1 && bday == 18) ac = ac120;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 1 && bday == 19) ac = ac121;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 1 && bday == 20) ac = ac122;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 1 && bday == 21) ac = ac123;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 1 && bday == 22) ac = ac124;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 1 && bday == 23) ac = ac125;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 1 && bday == 24) ac = ac126;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 1 && bday == 25) ac = ac127;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 1 && bday == 26) ac = ac128;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 1 && bday == 27) ac = ac129;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 1 && bday == 28) ac = ac130;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 1 && bday == 29) ac = ac131;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 1 && bday == 30) ac = ac132;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 1 && bday == 31) ac = ac133;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 2 && bday == 1) ac = ac134;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 2 && bday == 2) ac = ac135;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 2 && bday == 3) ac = ac136;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 2 && bday == 4) ac = ac137;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 2 && bday == 5) ac = ac138;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 2 && bday == 6) ac = ac139;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 2 && bday == 7) ac = ac140;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 2 && bday == 8) ac = ac141;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 2 && bday == 9) ac = ac142;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 2 && bday == 10) ac = ac143;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 2 && bday == 11) ac = ac144;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 2 && bday == 12) ac = ac145;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 2 && bday == 13) ac = ac146;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 2 && bday == 14) ac = ac147;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 2 && bday == 15) ac = ac148;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 2 && bday == 16) ac = ac149;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 2 && bday == 17) ac = ac150;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 2 && bday == 18) ac = ac151;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 2 && bday == 19) ac = ac152;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 2 && bday == 20) ac = ac153;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 2 && bday == 21) ac = ac154;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 2 && bday == 22) ac = ac155;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 2 && bday == 23) ac = ac156;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 2 && bday == 24) ac = ac157;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 2 && bday == 25) ac = ac158;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 2 && bday == 26) ac = ac159;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 2 && bday == 27) ac = ac160;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 12) && bmonth == 2 && bday == 28) ac = ac161;
            if ((abbb == 12) && bmonth == 2 && bday == 29) ac = ac162;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 3 && bday == 1) ac = ac162;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 3 && bday == 2) ac = ac163;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 3 && bday == 3) ac = ac164;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 3 && bday == 4) ac = ac165;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 3 && bday == 5) ac = ac166;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 3 && bday == 6) ac = ac167;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 3 && bday == 7) ac = ac168;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 3 && bday == 8) ac = ac169;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 3 && bday == 9) ac = ac170;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 3 && bday == 10) ac = ac171;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 3 && bday == 11) ac = ac172;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 3 && bday == 12) ac = ac173;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 3 && bday == 13) ac = ac174;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 3 && bday == 14) ac = ac175;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 3 && bday == 15) ac = ac176;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 3 && bday == 16) ac = ac177;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 3 && bday == 17) ac = ac178;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 3 && bday == 18) ac = ac179;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 3 && bday == 19) ac = ac180;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 3 && bday == 20) ac = ac181;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 3 && bday == 21) ac = ac182;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 3 && bday == 22) ac = ac183;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 3 && bday == 23) ac = ac184;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 3 && bday == 24) ac = ac185;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 3 && bday == 25) ac = ac186;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 3 && bday == 26) ac = ac187;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 3 && bday == 27) ac = ac188;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 3 && bday == 28) ac = ac189;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 3 && bday == 29) ac = ac190;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 3 && bday == 30) ac = ac191;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 3 && bday == 31) ac = ac192;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 4 && bday == 1) ac = ac193;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 4 && bday == 2) ac = ac194;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 4 && bday == 3) ac = ac195;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 4 && bday == 4) ac = ac196;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 4 && bday == 5) ac = ac197;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 4 && bday == 6) ac = ac198;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 4 && bday == 7) ac = ac199;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 4 && bday == 8) ac = ac200;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 4 && bday == 9) ac = ac201;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 4 && bday == 10) ac = ac202;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 4 && bday == 11) ac = ac203;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 4 && bday == 12) ac = ac204;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 4 && bday == 13) ac = ac205;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 4 && bday == 14) ac = ac206;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 4 && bday == 15) ac = ac207;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 4 && bday == 16) ac = ac208;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 4 && bday == 17) ac = ac209;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 4 && bday == 18) ac = ac210;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 4 && bday == 19) ac = ac211;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 4 && bday == 20) ac = ac212;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 4 && bday == 21) ac = ac213;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 4 && bday == 22) ac = ac214;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 4 && bday == 23) ac = ac215;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 4 && bday == 24) ac = ac216;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 4 && bday == 25) ac = ac217;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 4 && bday == 26) ac = ac218;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 4 && bday == 27) ac = ac219;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 4 && bday == 28) ac = ac220;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 4 && bday == 29) ac = ac221;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 4 && bday == 30) ac = ac222;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 5 && bday == 1) ac = ac223;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 5 && bday == 2) ac = ac224;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 5 && bday == 3) ac = ac225;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 5 && bday == 4) ac = ac226;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 5 && bday == 5) ac = ac227;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 5 && bday == 6) ac = ac228;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 5 && bday == 7) ac = ac229;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 5 && bday == 8) ac = ac230;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 5 && bday == 9) ac = ac231;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 5 && bday == 10) ac = ac232;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 5 && bday == 11) ac = ac233;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 5 && bday == 12) ac = ac234;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 5 && bday == 13) ac = ac235;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 5 && bday == 14) ac = ac236;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 5 && bday == 15) ac = ac237;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 5 && bday == 16) ac = ac238;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 5 && bday == 17) ac = ac239;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 5 && bday == 18) ac = ac240;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 5 && bday == 19) ac = ac241;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 5 && bday == 20) ac = ac242;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 5 && bday == 21) ac = ac243;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 5 && bday == 22) ac = ac244;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 5 && bday == 23) ac = ac245;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 5 && bday == 24) ac = ac246;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 5 && bday == 25) ac = ac247;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 5 && bday == 26) ac = ac248;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 5 && bday == 27) ac = ac249;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 5 && bday == 28) ac = ac250;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 5 && bday == 29) ac = ac251;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 5 && bday == 30) ac = ac252;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 5 && bday == 31) ac = ac253;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 6 && bday == 1) ac = ac254;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 6 && bday == 2) ac = ac255;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 6 && bday == 3) ac = ac256;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 6 && bday == 4) ac = ac257;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 6 && bday == 5) ac = ac258;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 6 && bday == 6) ac = ac259;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 6 && bday == 7) ac = ac260;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 6 && bday == 8) ac = ac261;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 6 && bday == 9) ac = ac262;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 6 && bday == 10) ac = ac263;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 6 && bday == 11) ac = ac264;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 6 && bday == 12) ac = ac265;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 6 && bday == 13) ac = ac266;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 6 && bday == 14) ac = ac267;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 6 && bday == 15) ac = ac268;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 6 && bday == 16) ac = ac269;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 6 && bday == 17) ac = ac270;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 6 && bday == 18) ac = ac271;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 6 && bday == 19) ac = ac272;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 6 && bday == 20) ac = ac273;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 6 && bday == 21) ac = ac274;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 6 && bday == 22) ac = ac275;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 6 && bday == 23) ac = ac276;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 6 && bday == 24) ac = ac277;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 6 && bday == 25) ac = ac278;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 6 && bday == 26) ac = ac279;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 6 && bday == 27) ac = ac280;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 6 && bday == 28) ac = ac281;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 6 && bday == 29) ac = ac282;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 6 && bday == 30) ac = ac283;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 7 && bday == 1) ac = ac284;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 7 && bday == 2) ac = ac285;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 7 && bday == 3) ac = ac286;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 7 && bday == 4) ac = ac287;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 7 && bday == 5) ac = ac288;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 7 && bday == 6) ac = ac289;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 7 && bday == 7) ac = ac290;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 7 && bday == 8) ac = ac291;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 7 && bday == 9) ac = ac292;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 7 && bday == 10) ac = ac293;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 7 && bday == 11) ac = ac294;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 7 && bday == 12) ac = ac295;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 7 && bday == 13) ac = ac296;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 7 && bday == 14) ac = ac297;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 7 && bday == 15) ac = ac298;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 7 && bday == 16) ac = ac299;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 7 && bday == 17) ac = ac300;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 7 && bday == 18) ac = ac301;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 7 && bday == 19) ac = ac302;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 7 && bday == 20) ac = ac303;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 7 && bday == 21) ac = ac304;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 7 && bday == 22) ac = ac305;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 7 && bday == 23) ac = ac306;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 7 && bday == 24) ac = ac307;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 7 && bday == 25) ac = ac308;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 7 && bday == 26) ac = ac309;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 7 && bday == 27) ac = ac310;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 7 && bday == 28) ac = ac311;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 7 && bday == 29) ac = ac312;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 7 && bday == 30) ac = ac313;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 7 && bday == 31) ac = ac314;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 8 && bday == 1) ac = ac315;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 8 && bday == 2) ac = ac316;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 8 && bday == 3) ac = ac317;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 8 && bday == 4) ac = ac318;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 8 && bday == 5) ac = ac319;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 8 && bday == 6) ac = ac320;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 8 && bday == 7) ac = ac321;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 8 && bday == 8) ac = ac322;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 8 && bday == 9) ac = ac323;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 8 && bday == 10) ac = ac324;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 8 && bday == 11) ac = ac325;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 8 && bday == 12) ac = ac326;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 8 && bday == 13) ac = ac327;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 8 && bday == 14) ac = ac328;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 8 && bday == 15) ac = ac329;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 8 && bday == 16) ac = ac330;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 8 && bday == 17) ac = ac331;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 8 && bday == 18) ac = ac332;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 8 && bday == 19) ac = ac333;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 8 && bday == 20) ac = ac334;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 8 && bday == 21) ac = ac335;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 8 && bday == 22) ac = ac336;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 8 && bday == 23) ac = ac337;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 8 && bday == 24) ac = ac338;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 8 && bday == 25) ac = ac339;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 8 && bday == 26) ac = ac340;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 8 && bday == 27) ac = ac341;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 8 && bday == 28) ac = ac342;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 8 && bday == 29) ac = ac343;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 8 && bday == 30) ac = ac344;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 8 && bday == 31) ac = ac345;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 9 && bday == 1) ac = ac346;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 9 && bday == 2) ac = ac347;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 9 && bday == 3) ac = ac348;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 9 && bday == 4) ac = ac349;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 9 && bday == 5) ac = ac350;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 9 && bday == 6) ac = ac351;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 9 && bday == 7) ac = ac352;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 9 && bday == 8) ac = ac353;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 9 && bday == 9) ac = ac354;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 9 && bday == 10) ac = ac355;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 9 && bday == 11) ac = ac356;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 9 && bday == 12) ac = ac357;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 9 && bday == 13) ac = ac358;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 9 && bday == 14) ac = ac359;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 9 && bday == 15) ac = ac360;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 9 && bday == 16) ac = ac361;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 9 && bday == 17) ac = ac362;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 9 && bday == 18) ac = ac363;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 9 && bday == 19) ac = ac364;
            if ((abbb == 9 || abbb == 10 || abbb == 11 || abbb == 8) && bmonth == 9 && bday == 20) ac = ac365;
            //13,14,15						
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 9 && bday == 20) ac = ac1;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 9 && bday == 21) ac = ac2;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 9 && bday == 22) ac = ac3;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 9 && bday == 23) ac = ac4;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 9 && bday == 24) ac = ac5;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 9 && bday == 25) ac = ac6;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 9 && bday == 26) ac = ac7;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 9 && bday == 27) ac = ac8;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 9 && bday == 28) ac = ac9;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 9 && bday == 29) ac = ac10;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 9 && bday == 30) ac = ac11;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 10 && bday == 1) ac = ac12;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 10 && bday == 2) ac = ac13;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 10 && bday == 3) ac = ac14;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 10 && bday == 4) ac = ac15;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 10 && bday == 5) ac = ac16;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 10 && bday == 6) ac = ac17;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 10 && bday == 7) ac = ac18;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 10 && bday == 8) ac = ac19;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 10 && bday == 9) ac = ac20;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 10 && bday == 10) ac = ac21;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 10 && bday == 11) ac = ac22;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 10 && bday == 12) ac = ac23;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 10 && bday == 13) ac = ac24;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 10 && bday == 14) ac = ac25;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 10 && bday == 15) ac = ac26;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 10 && bday == 16) ac = ac27;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 10 && bday == 17) ac = ac28;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 10 && bday == 18) ac = ac29;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 10 && bday == 19) ac = ac30;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 10 && bday == 20) ac = ac31;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 10 && bday == 21) ac = ac32;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 10 && bday == 22) ac = ac33;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 10 && bday == 23) ac = ac34;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 10 && bday == 24) ac = ac35;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 10 && bday == 25) ac = ac36;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 10 && bday == 26) ac = ac37;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 10 && bday == 27) ac = ac38;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 10 && bday == 28) ac = ac39;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 10 && bday == 29) ac = ac40;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 10 && bday == 30) ac = ac41;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 10 && bday == 31) ac = ac42;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 11 && bday == 1) ac = ac43;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 11 && bday == 2) ac = ac44;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 11 && bday == 3) ac = ac45;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 11 && bday == 4) ac = ac46;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 11 && bday == 5) ac = ac47;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 11 && bday == 6) ac = ac48;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 11 && bday == 7) ac = ac49;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 11 && bday == 8) ac = ac50;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 11 && bday == 9) ac = ac51;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 11 && bday == 10) ac = ac52;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 11 && bday == 11) ac = ac53;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 11 && bday == 12) ac = ac54;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 11 && bday == 13) ac = ac55;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 11 && bday == 14) ac = ac56;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 11 && bday == 15) ac = ac57;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 11 && bday == 16) ac = ac58;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 11 && bday == 17) ac = ac59;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 11 && bday == 18) ac = ac60;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 11 && bday == 19) ac = ac61;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 11 && bday == 20) ac = ac62;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 11 && bday == 21) ac = ac63;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 11 && bday == 22) ac = ac64;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 11 && bday == 23) ac = ac65;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 11 && bday == 24) ac = ac66;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 11 && bday == 25) ac = ac67;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 11 && bday == 26) ac = ac68;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 11 && bday == 27) ac = ac69;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 11 && bday == 28) ac = ac70;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 11 && bday == 29) ac = ac71;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 11 && bday == 30) ac = ac72;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 12 && bday == 1) ac = ac73;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 12 && bday == 2) ac = ac74;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 12 && bday == 3) ac = ac75;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 12 && bday == 4) ac = ac76;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 12 && bday == 5) ac = ac77;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 12 && bday == 6) ac = ac78;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 12 && bday == 7) ac = ac79;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 12 && bday == 8) ac = ac80;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 16) && bmonth == 12 && bday == 9) ac = ac81;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 12 && bday == 10) ac = ac82;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 12 && bday == 11) ac = ac83;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 12 && bday == 12) ac = ac84;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 12 && bday == 13) ac = ac85;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 12 && bday == 14) ac = ac86;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 12 && bday == 15) ac = ac87;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 12 && bday == 16) ac = ac88;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 12 && bday == 17) ac = ac89;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 12 && bday == 18) ac = ac90;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 12 && bday == 19) ac = ac91;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 12 && bday == 20) ac = ac92;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 12 && bday == 21) ac = ac93;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 12 && bday == 22) ac = ac94;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 12 && bday == 23) ac = ac95;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 12 && bday == 24) ac = ac96;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 12 && bday == 25) ac = ac97;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 12 && bday == 26) ac = ac98;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 12 && bday == 27) ac = ac99;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 12 && bday == 28) ac = ac100;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 12 && bday == 29) ac = ac101;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 12 && bday == 30) ac = ac102;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 12 && bday == 31) ac = ac103;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 1 && bday == 1) ac = ac104;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 1 && bday == 2) ac = ac105;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 1 && bday == 3) ac = ac106;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 1 && bday == 4) ac = ac107;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 1 && bday == 5) ac = ac108;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 1 && bday == 6) ac = ac109;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 1 && bday == 7) ac = ac110;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 1 && bday == 8) ac = ac111;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 1 && bday == 9) ac = ac112;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 1 && bday == 10) ac = ac113;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 1 && bday == 11) ac = ac114;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 1 && bday == 12) ac = ac115;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 1 && bday == 13) ac = ac116;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 1 && bday == 14) ac = ac117;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 1 && bday == 15) ac = ac118;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 1 && bday == 16) ac = ac119;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 1 && bday == 17) ac = ac120;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 1 && bday == 18) ac = ac121;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 1 && bday == 19) ac = ac122;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 1 && bday == 20) ac = ac123;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 1 && bday == 21) ac = ac124;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 1 && bday == 22) ac = ac125;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 1 && bday == 23) ac = ac126;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 1 && bday == 24) ac = ac127;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 1 && bday == 25) ac = ac128;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 1 && bday == 26) ac = ac129;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 1 && bday == 27) ac = ac130;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 1 && bday == 28) ac = ac131;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 1 && bday == 29) ac = ac132;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 1 && bday == 30) ac = ac133;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 1 && bday == 31) ac = ac134;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 2 && bday == 1) ac = ac135;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 2 && bday == 2) ac = ac136;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 2 && bday == 3) ac = ac137;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 2 && bday == 4) ac = ac138;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 2 && bday == 5) ac = ac139;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 2 && bday == 6) ac = ac140;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 2 && bday == 7) ac = ac141;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 2 && bday == 8) ac = ac142;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 2 && bday == 9) ac = ac143;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 2 && bday == 10) ac = ac144;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 2 && bday == 11) ac = ac145;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 2 && bday == 12) ac = ac146;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 2 && bday == 13) ac = ac147;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 2 && bday == 14) ac = ac148;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 2 && bday == 15) ac = ac149;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 2 && bday == 16) ac = ac150;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 2 && bday == 17) ac = ac151;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 2 && bday == 18) ac = ac152;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 2 && bday == 19) ac = ac153;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 2 && bday == 20) ac = ac154;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 2 && bday == 21) ac = ac155;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 2 && bday == 22) ac = ac156;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 2 && bday == 23) ac = ac157;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 2 && bday == 24) ac = ac158;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 2 && bday == 25) ac = ac159;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 2 && bday == 26) ac = ac160;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 2 && bday == 27) ac = ac161;
            if ((abbb == 13 || abbb == 14 || abbb == 15) && bmonth == 2 && bday == 28) ac = ac162;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 3 && bday == 1) ac = ac163;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 3 && bday == 2) ac = ac164;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 3 && bday == 3) ac = ac165;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 3 && bday == 4) ac = ac166;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 3 && bday == 5) ac = ac167;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 3 && bday == 6) ac = ac168;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 3 && bday == 7) ac = ac169;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 3 && bday == 8) ac = ac170;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 3 && bday == 9) ac = ac171;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 3 && bday == 10) ac = ac172;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 3 && bday == 11) ac = ac173;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 3 && bday == 12) ac = ac174;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 3 && bday == 13) ac = ac175;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 3 && bday == 14) ac = ac176;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 3 && bday == 15) ac = ac177;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 3 && bday == 16) ac = ac178;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 3 && bday == 17) ac = ac179;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 3 && bday == 18) ac = ac180;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 3 && bday == 19) ac = ac181;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 3 && bday == 20) ac = ac182;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 3 && bday == 21) ac = ac183;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 3 && bday == 22) ac = ac184;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 3 && bday == 23) ac = ac185;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 3 && bday == 24) ac = ac186;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 3 && bday == 25) ac = ac187;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 3 && bday == 26) ac = ac188;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 3 && bday == 27) ac = ac189;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 3 && bday == 28) ac = ac190;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 3 && bday == 29) ac = ac191;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 3 && bday == 30) ac = ac192;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 3 && bday == 31) ac = ac193;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 4 && bday == 1) ac = ac194;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 4 && bday == 2) ac = ac195;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 4 && bday == 3) ac = ac196;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 4 && bday == 4) ac = ac197;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 4 && bday == 5) ac = ac198;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 4 && bday == 6) ac = ac199;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 4 && bday == 7) ac = ac200;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 4 && bday == 8) ac = ac201;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 4 && bday == 9) ac = ac202;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 4 && bday == 10) ac = ac203;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 4 && bday == 11) ac = ac204;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 4 && bday == 12) ac = ac205;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 4 && bday == 13) ac = ac206;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 4 && bday == 14) ac = ac207;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 4 && bday == 15) ac = ac208;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 4 && bday == 16) ac = ac209;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 4 && bday == 17) ac = ac210;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 4 && bday == 18) ac = ac211;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 4 && bday == 19) ac = ac212;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 4 && bday == 20) ac = ac213;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 4 && bday == 21) ac = ac214;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 4 && bday == 22) ac = ac215;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 4 && bday == 23) ac = ac216;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 4 && bday == 24) ac = ac217;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 4 && bday == 25) ac = ac218;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 4 && bday == 26) ac = ac219;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 4 && bday == 27) ac = ac220;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 4 && bday == 28) ac = ac221;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 4 && bday == 29) ac = ac222;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 4 && bday == 30) ac = ac223;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 5 && bday == 1) ac = ac224;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 5 && bday == 2) ac = ac225;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 5 && bday == 3) ac = ac226;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 5 && bday == 4) ac = ac227;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 5 && bday == 5) ac = ac228;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 5 && bday == 6) ac = ac229;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 5 && bday == 7) ac = ac230;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 5 && bday == 8) ac = ac231;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 5 && bday == 9) ac = ac232;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 5 && bday == 10) ac = ac233;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 5 && bday == 11) ac = ac234;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 5 && bday == 12) ac = ac235;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 5 && bday == 13) ac = ac236;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 5 && bday == 14) ac = ac237;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 5 && bday == 15) ac = ac238;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 5 && bday == 16) ac = ac239;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 5 && bday == 17) ac = ac240;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 5 && bday == 18) ac = ac241;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 5 && bday == 19) ac = ac242;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 5 && bday == 20) ac = ac243;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 5 && bday == 21) ac = ac244;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 5 && bday == 22) ac = ac245;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 5 && bday == 23) ac = ac246;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 5 && bday == 24) ac = ac247;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 5 && bday == 25) ac = ac248;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 5 && bday == 26) ac = ac249;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 5 && bday == 27) ac = ac250;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 5 && bday == 28) ac = ac251;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 5 && bday == 29) ac = ac252;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 5 && bday == 30) ac = ac253;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 5 && bday == 31) ac = ac254;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 6 && bday == 1) ac = ac255;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 6 && bday == 2) ac = ac256;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 6 && bday == 3) ac = ac257;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 6 && bday == 4) ac = ac258;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 6 && bday == 5) ac = ac259;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 6 && bday == 6) ac = ac260;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 6 && bday == 7) ac = ac261;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 6 && bday == 8) ac = ac262;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 6 && bday == 9) ac = ac263;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 6 && bday == 10) ac = ac264;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 6 && bday == 11) ac = ac265;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 6 && bday == 12) ac = ac266;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 6 && bday == 13) ac = ac267;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 6 && bday == 14) ac = ac268;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 6 && bday == 15) ac = ac269;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 6 && bday == 16) ac = ac270;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 6 && bday == 17) ac = ac271;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 6 && bday == 18) ac = ac272;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 6 && bday == 19) ac = ac273;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 6 && bday == 20) ac = ac274;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 6 && bday == 21) ac = ac275;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 6 && bday == 22) ac = ac276;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 6 && bday == 23) ac = ac277;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 6 && bday == 24) ac = ac278;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 6 && bday == 25) ac = ac279;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 6 && bday == 26) ac = ac280;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 6 && bday == 27) ac = ac281;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 6 && bday == 28) ac = ac282;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 6 && bday == 29) ac = ac283;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 6 && bday == 30) ac = ac284;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 7 && bday == 1) ac = ac285;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 7 && bday == 2) ac = ac286;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 7 && bday == 3) ac = ac287;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 7 && bday == 4) ac = ac288;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 7 && bday == 5) ac = ac289;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 7 && bday == 6) ac = ac290;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 7 && bday == 7) ac = ac291;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 7 && bday == 8) ac = ac292;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 7 && bday == 9) ac = ac293;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 7 && bday == 10) ac = ac294;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 7 && bday == 11) ac = ac295;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 7 && bday == 12) ac = ac296;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 7 && bday == 13) ac = ac297;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 7 && bday == 14) ac = ac298;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 7 && bday == 15) ac = ac299;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 7 && bday == 16) ac = ac300;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 7 && bday == 17) ac = ac301;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 7 && bday == 18) ac = ac302;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 7 && bday == 19) ac = ac303;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 7 && bday == 20) ac = ac304;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 7 && bday == 21) ac = ac305;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 7 && bday == 22) ac = ac306;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 7 && bday == 23) ac = ac307;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 7 && bday == 24) ac = ac308;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 7 && bday == 25) ac = ac309;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 7 && bday == 26) ac = ac310;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 7 && bday == 27) ac = ac311;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 7 && bday == 28) ac = ac312;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 7 && bday == 29) ac = ac313;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 7 && bday == 30) ac = ac314;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 7 && bday == 31) ac = ac315;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 8 && bday == 1) ac = ac316;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 8 && bday == 2) ac = ac317;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 8 && bday == 3) ac = ac318;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 8 && bday == 4) ac = ac319;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 8 && bday == 5) ac = ac320;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 8 && bday == 6) ac = ac321;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 8 && bday == 7) ac = ac322;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 8 && bday == 8) ac = ac323;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 8 && bday == 9) ac = ac324;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 8 && bday == 10) ac = ac325;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 8 && bday == 11) ac = ac326;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 8 && bday == 12) ac = ac327;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 8 && bday == 13) ac = ac328;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 8 && bday == 14) ac = ac329;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 8 && bday == 15) ac = ac330;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 8 && bday == 16) ac = ac331;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 8 && bday == 17) ac = ac332;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 8 && bday == 18) ac = ac333;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 8 && bday == 19) ac = ac334;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 8 && bday == 20) ac = ac335;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 8 && bday == 21) ac = ac336;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 8 && bday == 22) ac = ac337;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 8 && bday == 23) ac = ac338;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 8 && bday == 24) ac = ac339;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 8 && bday == 25) ac = ac340;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 8 && bday == 26) ac = ac341;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 8 && bday == 27) ac = ac342;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 8 && bday == 28) ac = ac343;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 8 && bday == 29) ac = ac344;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 8 && bday == 30) ac = ac345;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 8 && bday == 31) ac = ac346;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 9 && bday == 1) ac = ac347;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 9 && bday == 2) ac = ac348;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 9 && bday == 3) ac = ac349;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 9 && bday == 4) ac = ac350;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 9 && bday == 5) ac = ac351;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 9 && bday == 6) ac = ac352;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 9 && bday == 7) ac = ac353;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 9 && bday == 8) ac = ac354;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 9 && bday == 9) ac = ac355;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 9 && bday == 10) ac = ac356;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 9 && bday == 11) ac = ac357;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 9 && bday == 12) ac = ac358;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 9 && bday == 13) ac = ac359;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 9 && bday == 14) ac = ac360;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 9 && bday == 15) ac = ac361;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 9 && bday == 16) ac = ac362;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 9 && bday == 17) ac = ac363;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 9 && bday == 18) ac = ac364;
            if ((abbb == 13 || abbb == 14 || abbb == 15 || abbb == 12) && bmonth == 9 && bday == 19) ac = ac365;
            //16			
            if (abbb == 16 && bmonth == 12 && bday == 10) ac = ac366;

            if (abbb == 16 && bmonth == 12 && bday == 11) ac = ac82;
            if (abbb == 16 && bmonth == 12 && bday == 12) ac = ac83;
            if (abbb == 16 && bmonth == 12 && bday == 13) ac = ac84;
            if (abbb == 16 && bmonth == 12 && bday == 14) ac = ac85;
            if (abbb == 16 && bmonth == 12 && bday == 15) ac = ac86;
            if (abbb == 16 && bmonth == 12 && bday == 16) ac = ac87;
            if (abbb == 16 && bmonth == 12 && bday == 17) ac = ac88;
            if (abbb == 16 && bmonth == 12 && bday == 18) ac = ac89;
            if (abbb == 16 && bmonth == 12 && bday == 19) ac = ac90;
            if (abbb == 16 && bmonth == 12 && bday == 20) ac = ac91;
            if (abbb == 16 && bmonth == 12 && bday == 21) ac = ac92;
            if (abbb == 16 && bmonth == 12 && bday == 22) ac = ac93;
            if (abbb == 16 && bmonth == 12 && bday == 23) ac = ac94;
            if (abbb == 16 && bmonth == 12 && bday == 24) ac = ac95;
            if (abbb == 16 && bmonth == 12 && bday == 25) ac = ac96;
            if (abbb == 16 && bmonth == 12 && bday == 26) ac = ac97;
            if (abbb == 16 && bmonth == 12 && bday == 27) ac = ac98;
            if (abbb == 16 && bmonth == 12 && bday == 28) ac = ac99;
            if (abbb == 16 && bmonth == 12 && bday == 29) ac = ac100;
            if (abbb == 16 && bmonth == 12 && bday == 30) ac = ac101;
            if (abbb == 16 && bmonth == 12 && bday == 31) ac = ac102;
            if (abbb == 16 && bmonth == 1 && bday == 1) ac = ac103;
            if (abbb == 16 && bmonth == 1 && bday == 2) ac = ac104;
            if (abbb == 16 && bmonth == 1 && bday == 3) ac = ac105;
            if (abbb == 16 && bmonth == 1 && bday == 4) ac = ac106;
            if (abbb == 16 && bmonth == 1 && bday == 5) ac = ac107;
            if (abbb == 16 && bmonth == 1 && bday == 6) ac = ac108;
            if (abbb == 16 && bmonth == 1 && bday == 7) ac = ac109;
            if (abbb == 16 && bmonth == 1 && bday == 8) ac = ac110;
            if (abbb == 16 && bmonth == 1 && bday == 9) ac = ac111;
            if (abbb == 16 && bmonth == 1 && bday == 10) ac = ac112;
            if (abbb == 16 && bmonth == 1 && bday == 11) ac = ac113;
            if (abbb == 16 && bmonth == 1 && bday == 12) ac = ac114;
            if (abbb == 16 && bmonth == 1 && bday == 13) ac = ac115;
            if (abbb == 16 && bmonth == 1 && bday == 14) ac = ac116;
            if (abbb == 16 && bmonth == 1 && bday == 15) ac = ac117;
            if (abbb == 16 && bmonth == 1 && bday == 16) ac = ac118;
            if (abbb == 16 && bmonth == 1 && bday == 17) ac = ac119;
            if (abbb == 16 && bmonth == 1 && bday == 18) ac = ac120;
            if (abbb == 16 && bmonth == 1 && bday == 19) ac = ac121;
            if (abbb == 16 && bmonth == 1 && bday == 20) ac = ac122;

            if (abbb == 16 && bmonth == 1 && bday == 21) ac = ac123;
            if (abbb == 16 && bmonth == 1 && bday == 22) ac = ac124;
            if (abbb == 16 && bmonth == 1 && bday == 23) ac = ac125;
            if (abbb == 16 && bmonth == 1 && bday == 24) ac = ac126;
            if (abbb == 16 && bmonth == 1 && bday == 25) ac = ac127;
            if (abbb == 16 && bmonth == 1 && bday == 26) ac = ac128;
            if (abbb == 16 && bmonth == 1 && bday == 27) ac = ac129;
            if (abbb == 16 && bmonth == 1 && bday == 28) ac = ac130;
            if (abbb == 16 && bmonth == 1 && bday == 29) ac = ac131;
            if (abbb == 16 && bmonth == 1 && bday == 30) ac = ac132;
            if (abbb == 16 && bmonth == 1 && bday == 31) ac = ac133;
            if (abbb == 16 && bmonth == 2 && bday == 1) ac = ac134;
            if (abbb == 16 && bmonth == 2 && bday == 2) ac = ac135;
            if (abbb == 16 && bmonth == 2 && bday == 3) ac = ac136;
            if (abbb == 16 && bmonth == 2 && bday == 4) ac = ac137;
            if (abbb == 16 && bmonth == 2 && bday == 5) ac = ac138;
            if (abbb == 16 && bmonth == 2 && bday == 6) ac = ac139;
            if (abbb == 16 && bmonth == 2 && bday == 7) ac = ac140;
            if (abbb == 16 && bmonth == 2 && bday == 8) ac = ac141;
            if (abbb == 16 && bmonth == 2 && bday == 9) ac = ac142;
            if (abbb == 16 && bmonth == 2 && bday == 10) ac = ac143;
            if (abbb == 16 && bmonth == 2 && bday == 11) ac = ac144;
            if (abbb == 16 && bmonth == 2 && bday == 12) ac = ac145;
            if (abbb == 16 && bmonth == 2 && bday == 13) ac = ac146;
            if (abbb == 16 && bmonth == 2 && bday == 14) ac = ac147;
            if (abbb == 16 && bmonth == 2 && bday == 15) ac = ac148;
            if (abbb == 16 && bmonth == 2 && bday == 16) ac = ac149;
            if (abbb == 16 && bmonth == 2 && bday == 17) ac = ac150;
            if (abbb == 16 && bmonth == 2 && bday == 18) ac = ac151;
            if (abbb == 16 && bmonth == 2 && bday == 19) ac = ac152;
            if (abbb == 16 && bmonth == 2 && bday == 20) ac = ac153;
            if (abbb == 16 && bmonth == 2 && bday == 21) ac = ac154;
            if (abbb == 16 && bmonth == 2 && bday == 22) ac = ac155;
            if (abbb == 16 && bmonth == 2 && bday == 23) ac = ac156;
            if (abbb == 16 && bmonth == 2 && bday == 24) ac = ac157;
            if (abbb == 16 && bmonth == 2 && bday == 25) ac = ac158;
            if (abbb == 16 && bmonth == 2 && bday == 26) ac = ac159;
            if (abbb == 16 && bmonth == 2 && bday == 27) ac = ac160;
            if (abbb == 16 && bmonth == 2 && bday == 28) ac = ac161;
            if (abbb == 16 && bmonth == 2 && bday == 29) ac = ac162;
            if (abbb == 16 && bmonth == 3 && bday == 1) ac = ac367;

            if (abbb == 16 && bmonth == 3 && bday == 2) ac = ac163;
            if (abbb == 16 && bmonth == 3 && bday == 3) ac = ac164;
            if (abbb == 16 && bmonth == 3 && bday == 4) ac = ac165;
            if (abbb == 16 && bmonth == 3 && bday == 5) ac = ac166;
            if (abbb == 16 && bmonth == 3 && bday == 6) ac = ac167;
            if (abbb == 16 && bmonth == 3 && bday == 7) ac = ac168;
            if (abbb == 16 && bmonth == 3 && bday == 8) ac = ac169;
            if (abbb == 16 && bmonth == 3 && bday == 9) ac = ac170;
            if (abbb == 16 && bmonth == 3 && bday == 10) ac = ac171;
            if (abbb == 16 && bmonth == 3 && bday == 11) ac = ac172;
            if (abbb == 16 && bmonth == 3 && bday == 12) ac = ac173;
            if (abbb == 16 && bmonth == 3 && bday == 13) ac = ac174;
            if (abbb == 16 && bmonth == 3 && bday == 14) ac = ac175;
            if (abbb == 16 && bmonth == 3 && bday == 15) ac = ac176;
            if (abbb == 16 && bmonth == 3 && bday == 16) ac = ac177;
            if (abbb == 16 && bmonth == 3 && bday == 17) ac = ac178;
            if (abbb == 16 && bmonth == 3 && bday == 18) ac = ac179;
            if (abbb == 16 && bmonth == 3 && bday == 19) ac = ac180;
            if (abbb == 16 && bmonth == 3 && bday == 20) ac = ac181;
            if (abbb == 16 && bmonth == 3 && bday == 21) ac = ac182;
            if (abbb == 16 && bmonth == 3 && bday == 22) ac = ac183;
            if (abbb == 16 && bmonth == 3 && bday == 23) ac = ac184;
            if (abbb == 16 && bmonth == 3 && bday == 24) ac = ac185;
            if (abbb == 16 && bmonth == 3 && bday == 25) ac = ac186;
            if (abbb == 16 && bmonth == 3 && bday == 26) ac = ac187;
            if (abbb == 16 && bmonth == 3 && bday == 27) ac = ac188;
            if (abbb == 16 && bmonth == 3 && bday == 28) ac = ac189;
            if (abbb == 16 && bmonth == 3 && bday == 29) ac = ac190;
            if (abbb == 16 && bmonth == 3 && bday == 30) ac = ac191;
            if (abbb == 16 && bmonth == 3 && bday == 31) ac = ac192;
            if (abbb == 16 && bmonth == 4 && bday == 1) ac = ac193;
            if (abbb == 16 && bmonth == 4 && bday == 2) ac = ac194;
            if (abbb == 16 && bmonth == 4 && bday == 3) ac = ac195;
            if (abbb == 16 && bmonth == 4 && bday == 4) ac = ac196;
            if (abbb == 16 && bmonth == 4 && bday == 5) ac = ac197;
            if (abbb == 16 && bmonth == 4 && bday == 6) ac = ac198;
            if (abbb == 16 && bmonth == 4 && bday == 7) ac = ac199;
            if (abbb == 16 && bmonth == 4 && bday == 8) ac = ac200;
            if (abbb == 16 && bmonth == 4 && bday == 9) ac = ac201;
            if (abbb == 16 && bmonth == 4 && bday == 10) ac = ac202;
            if (abbb == 16 && bmonth == 4 && bday == 11) ac = ac203;

            if (abbb == 16 && bmonth == 4 && bday == 12) ac = ac204;
            if (abbb == 16 && bmonth == 4 && bday == 13) ac = ac205;
            if (abbb == 16 && bmonth == 4 && bday == 14) ac = ac206;
            if (abbb == 16 && bmonth == 4 && bday == 15) ac = ac207;
            if (abbb == 16 && bmonth == 4 && bday == 16) ac = ac208;
            if (abbb == 16 && bmonth == 4 && bday == 17) ac = ac209;
            if (abbb == 16 && bmonth == 4 && bday == 18) ac = ac210;
            if (abbb == 16 && bmonth == 4 && bday == 19) ac = ac211;
            if (abbb == 16 && bmonth == 4 && bday == 20) ac = ac212;
            if (abbb == 16 && bmonth == 4 && bday == 21) ac = ac213;
            if (abbb == 16 && bmonth == 4 && bday == 22) ac = ac214;
            if (abbb == 16 && bmonth == 4 && bday == 23) ac = ac215;
            if (abbb == 16 && bmonth == 4 && bday == 24) ac = ac216;
            if (abbb == 16 && bmonth == 4 && bday == 25) ac = ac217;
            if (abbb == 16 && bmonth == 4 && bday == 26) ac = ac218;
            if (abbb == 16 && bmonth == 4 && bday == 27) ac = ac219;
            if (abbb == 16 && bmonth == 4 && bday == 28) ac = ac220;
            if (abbb == 16 && bmonth == 4 && bday == 29) ac = ac221;
            if (abbb == 16 && bmonth == 4 && bday == 30) ac = ac222;
            if (abbb == 16 && bmonth == 5 && bday == 1) ac = ac223;
            if (abbb == 16 && bmonth == 5 && bday == 2) ac = ac224;
            if (abbb == 16 && bmonth == 5 && bday == 3) ac = ac225;
            if (abbb == 16 && bmonth == 5 && bday == 4) ac = ac226;
            if (abbb == 16 && bmonth == 5 && bday == 5) ac = ac227;
            if (abbb == 16 && bmonth == 5 && bday == 6) ac = ac228;
            if (abbb == 16 && bmonth == 5 && bday == 7) ac = ac229;
            if (abbb == 16 && bmonth == 5 && bday == 8) ac = ac230;
            if (abbb == 16 && bmonth == 5 && bday == 9) ac = ac231;
            if (abbb == 16 && bmonth == 5 && bday == 10) ac = ac232;
            if (abbb == 16 && bmonth == 5 && bday == 11) ac = ac233;
            if (abbb == 16 && bmonth == 5 && bday == 12) ac = ac234;
            if (abbb == 16 && bmonth == 5 && bday == 13) ac = ac235;
            if (abbb == 16 && bmonth == 5 && bday == 14) ac = ac236;
            if (abbb == 16 && bmonth == 5 && bday == 15) ac = ac237;
            if (abbb == 16 && bmonth == 5 && bday == 16) ac = ac238;
            if (abbb == 16 && bmonth == 5 && bday == 17) ac = ac239;
            if (abbb == 16 && bmonth == 5 && bday == 18) ac = ac240;
            if (abbb == 16 && bmonth == 5 && bday == 19) ac = ac241;
            if (abbb == 16 && bmonth == 5 && bday == 20) ac = ac242;
            if (abbb == 16 && bmonth == 5 && bday == 21) ac = ac243;
            if (abbb == 16 && bmonth == 5 && bday == 22) ac = ac368;

            if (abbb == 16 && bmonth == 5 && bday == 23) ac = ac244;
            if (abbb == 16 && bmonth == 5 && bday == 24) ac = ac245;
            if (abbb == 16 && bmonth == 5 && bday == 25) ac = ac246;
            if (abbb == 16 && bmonth == 5 && bday == 26) ac = ac247;
            if (abbb == 16 && bmonth == 5 && bday == 27) ac = ac248;
            if (abbb == 16 && bmonth == 5 && bday == 28) ac = ac249;
            if (abbb == 16 && bmonth == 5 && bday == 29) ac = ac250;
            if (abbb == 16 && bmonth == 5 && bday == 30) ac = ac251;
            if (abbb == 16 && bmonth == 5 && bday == 31) ac = ac252;
            if (abbb == 16 && bmonth == 6 && bday == 1) ac = ac253;
            if (abbb == 16 && bmonth == 6 && bday == 2) ac = ac254;
            if (abbb == 16 && bmonth == 6 && bday == 3) ac = ac255;
            if (abbb == 16 && bmonth == 6 && bday == 4) ac = ac256;
            if (abbb == 16 && bmonth == 6 && bday == 5) ac = ac257;
            if (abbb == 16 && bmonth == 6 && bday == 6) ac = ac258;
            if (abbb == 16 && bmonth == 6 && bday == 7) ac = ac259;
            if (abbb == 16 && bmonth == 6 && bday == 8) ac = ac260;
            if (abbb == 16 && bmonth == 6 && bday == 9) ac = ac261;
            if (abbb == 16 && bmonth == 6 && bday == 10) ac = ac262;
            if (abbb == 16 && bmonth == 6 && bday == 11) ac = ac263;
            if (abbb == 16 && bmonth == 6 && bday == 12) ac = ac264;
            if (abbb == 16 && bmonth == 6 && bday == 13) ac = ac265;
            if (abbb == 16 && bmonth == 6 && bday == 14) ac = ac266;
            if (abbb == 16 && bmonth == 6 && bday == 15) ac = ac267;
            if (abbb == 16 && bmonth == 6 && bday == 16) ac = ac268;
            if (abbb == 16 && bmonth == 6 && bday == 17) ac = ac269;
            if (abbb == 16 && bmonth == 6 && bday == 18) ac = ac270;
            if (abbb == 16 && bmonth == 6 && bday == 19) ac = ac271;
            if (abbb == 16 && bmonth == 6 && bday == 20) ac = ac272;
            if (abbb == 16 && bmonth == 6 && bday == 21) ac = ac273;
            if (abbb == 16 && bmonth == 6 && bday == 22) ac = ac274;
            if (abbb == 16 && bmonth == 6 && bday == 23) ac = ac275;
            if (abbb == 16 && bmonth == 6 && bday == 24) ac = ac276;
            if (abbb == 16 && bmonth == 6 && bday == 25) ac = ac277;
            if (abbb == 16 && bmonth == 6 && bday == 26) ac = ac278;
            if (abbb == 16 && bmonth == 6 && bday == 27) ac = ac279;
            if (abbb == 16 && bmonth == 6 && bday == 28) ac = ac280;
            if (abbb == 16 && bmonth == 6 && bday == 29) ac = ac281;
            if (abbb == 16 && bmonth == 6 && bday == 30) ac = ac282;
            if (abbb == 16 && bmonth == 7 && bday == 1) ac = ac283;
            if (abbb == 16 && bmonth == 7 && bday == 2) ac = ac284;

            if (abbb == 16 && bmonth == 7 && bday == 3) ac = ac285;
            if (abbb == 16 && bmonth == 7 && bday == 4) ac = ac286;
            if (abbb == 16 && bmonth == 7 && bday == 5) ac = ac287;
            if (abbb == 16 && bmonth == 7 && bday == 6) ac = ac288;
            if (abbb == 16 && bmonth == 7 && bday == 7) ac = ac289;
            if (abbb == 16 && bmonth == 7 && bday == 8) ac = ac290;
            if (abbb == 16 && bmonth == 7 && bday == 9) ac = ac291;
            if (abbb == 16 && bmonth == 7 && bday == 10) ac = ac292;
            if (abbb == 16 && bmonth == 7 && bday == 11) ac = ac293;
            if (abbb == 16 && bmonth == 7 && bday == 12) ac = ac294;
            if (abbb == 16 && bmonth == 7 && bday == 13) ac = ac295;
            if (abbb == 16 && bmonth == 7 && bday == 14) ac = ac296;
            if (abbb == 16 && bmonth == 7 && bday == 15) ac = ac297;
            if (abbb == 16 && bmonth == 7 && bday == 16) ac = ac298;
            if (abbb == 16 && bmonth == 7 && bday == 17) ac = ac299;
            if (abbb == 16 && bmonth == 7 && bday == 18) ac = ac300;
            if (abbb == 16 && bmonth == 7 && bday == 19) ac = ac301;
            if (abbb == 16 && bmonth == 7 && bday == 20) ac = ac302;
            if (abbb == 16 && bmonth == 7 && bday == 21) ac = ac303;
            if (abbb == 16 && bmonth == 7 && bday == 22) ac = ac304;
            if (abbb == 16 && bmonth == 7 && bday == 23) ac = ac305;
            if (abbb == 16 && bmonth == 7 && bday == 24) ac = ac306;
            if (abbb == 16 && bmonth == 7 && bday == 25) ac = ac307;
            if (abbb == 16 && bmonth == 7 && bday == 26) ac = ac308;
            if (abbb == 16 && bmonth == 7 && bday == 27) ac = ac309;
            if (abbb == 16 && bmonth == 7 && bday == 28) ac = ac310;
            if (abbb == 16 && bmonth == 7 && bday == 29) ac = ac311;
            if (abbb == 16 && bmonth == 7 && bday == 30) ac = ac312;
            if (abbb == 16 && bmonth == 7 && bday == 31) ac = ac313;
            if (abbb == 16 && bmonth == 8 && bday == 1) ac = ac314;
            if (abbb == 16 && bmonth == 8 && bday == 2) ac = ac315;
            if (abbb == 16 && bmonth == 8 && bday == 3) ac = ac316;
            if (abbb == 16 && bmonth == 8 && bday == 4) ac = ac317;
            if (abbb == 16 && bmonth == 8 && bday == 5) ac = ac318;
            if (abbb == 16 && bmonth == 8 && bday == 6) ac = ac319;
            if (abbb == 16 && bmonth == 8 && bday == 7) ac = ac320;
            if (abbb == 16 && bmonth == 8 && bday == 8) ac = ac321;
            if (abbb == 16 && bmonth == 8 && bday == 9) ac = ac322;
            if (abbb == 16 && bmonth == 8 && bday == 10) ac = ac323;
            if (abbb == 16 && bmonth == 8 && bday == 11) ac = ac324;
            if (abbb == 16 && bmonth == 8 && bday == 12) ac = ac369;

            if (abbb == 16 && bmonth == 8 && bday == 13) ac = ac325;
            if (abbb == 16 && bmonth == 8 && bday == 14) ac = ac326;
            if (abbb == 16 && bmonth == 8 && bday == 15) ac = ac327;
            if (abbb == 16 && bmonth == 8 && bday == 16) ac = ac328;
            if (abbb == 16 && bmonth == 8 && bday == 17) ac = ac329;
            if (abbb == 16 && bmonth == 8 && bday == 18) ac = ac330;
            if (abbb == 16 && bmonth == 8 && bday == 19) ac = ac331;
            if (abbb == 16 && bmonth == 8 && bday == 20) ac = ac332;
            if (abbb == 16 && bmonth == 8 && bday == 21) ac = ac333;
            if (abbb == 16 && bmonth == 8 && bday == 22) ac = ac334;
            if (abbb == 16 && bmonth == 8 && bday == 23) ac = ac335;
            if (abbb == 16 && bmonth == 8 && bday == 24) ac = ac336;
            if (abbb == 16 && bmonth == 8 && bday == 25) ac = ac337;
            if (abbb == 16 && bmonth == 8 && bday == 26) ac = ac338;
            if (abbb == 16 && bmonth == 8 && bday == 27) ac = ac339;
            if (abbb == 16 && bmonth == 8 && bday == 28) ac = ac340;
            if (abbb == 16 && bmonth == 8 && bday == 29) ac = ac341;
            if (abbb == 16 && bmonth == 8 && bday == 30) ac = ac342;
            if (abbb == 16 && bmonth == 8 && bday == 31) ac = ac343;
            if (abbb == 16 && bmonth == 9 && bday == 1) ac = ac344;
            if (abbb == 16 && bmonth == 9 && bday == 2) ac = ac345;
            if (abbb == 16 && bmonth == 9 && bday == 3) ac = ac346;
            if (abbb == 16 && bmonth == 9 && bday == 4) ac = ac347;
            if (abbb == 16 && bmonth == 9 && bday == 5) ac = ac348;
            if (abbb == 16 && bmonth == 9 && bday == 6) ac = ac349;
            if (abbb == 16 && bmonth == 9 && bday == 7) ac = ac350;
            if (abbb == 16 && bmonth == 9 && bday == 8) ac = ac351;
            if (abbb == 16 && bmonth == 9 && bday == 9) ac = ac352;
            if (abbb == 16 && bmonth == 9 && bday == 10) ac = ac353;
            if (abbb == 16 && bmonth == 9 && bday == 11) ac = ac354;
            if (abbb == 16 && bmonth == 9 && bday == 12) ac = ac355;
            if (abbb == 16 && bmonth == 9 && bday == 13) ac = ac356;
            if (abbb == 16 && bmonth == 9 && bday == 14) ac = ac357;
            if (abbb == 16 && bmonth == 9 && bday == 15) ac = ac358;
            if (abbb == 16 && bmonth == 9 && bday == 16) ac = ac359;
            if (abbb == 16 && bmonth == 9 && bday == 17) ac = ac360;
            if (abbb == 16 && bmonth == 9 && bday == 18) ac = ac361;
            if (abbb == 16 && bmonth == 9 && bday == 19) ac = ac362;
            if (abbb == 16 && (dIyear % 2 == 0) && bmonth == 9 && bday == 20) ac = ac363;
            if (abbb == 16 && (dIyear % 2 == 0) && bmonth == 9 && bday == 21) ac = ac364;
            if (abbb == 16 && (dIyear % 2 == 0) && bmonth == 9 && bday == 22) ac = ac365;

            return ac;
        }

        public static (string, double) ZodiacPos(double deg)
        {
            string sunToday;
            double ratio;
            if (deg < 28.6)
            {
                sunToday = $"\u2653 Рыбы";
                ratio = Math.Round((deg + 7.9) * 1000 / 36.5) / 10;
            }
            else if (deg < 54.24)
            {
                sunToday = $"\u2648 Овен";
                ratio = Math.Round((deg - 28.6) * 1000 / 25.64) / 10;
            }
            else if (deg < 89.75)
            {
                sunToday = $"\u2649 Телец";
                ratio = Math.Round((deg - 54.24) * 1000 / 35.51) / 10;
            }
            else if (deg < 118.35)
            {
                sunToday = $"\u264A Близнецы";
                ratio = Math.Round((deg - 89.75) * 1000 / 28.6) / 10;
            }
            else if (deg < 140.05)
            {
                sunToday = $"\u264B Рак";
                ratio = Math.Round((deg - 118.35) * 1000 / 21.7) / 10;
            }
            else if (deg < 176.54)
            {
                sunToday = $"\u264C Лев";
                ratio = Math.Round((deg - 140.05) * 1000 / 36.49) / 10;
            }
            else if (deg < 219.94)
            {
                sunToday = $"\u264D Дева";
                ratio = Math.Round((deg - 176.54) * 1000 / 43.4) / 10;
            }
            else if (deg < 242.62)
            {
                sunToday = $"\u264E Весы";
                ratio = Math.Round((deg - 219.94) * 1000 / 22.68) / 10;
            }
            else if (deg < 250.51)
            {
                sunToday = $"\u264F Скорпион";
                ratio = Math.Round((deg - 242.62) * 1000 / 7.89) / 10;
            }
            else if (deg < 269.25)
            {
                sunToday = $"\u26CE Змееносец";
                ratio = Math.Round((deg - 250.51) * 1000 / 18.74) / 10;
            }
            else if (deg < 300.81)
            {
                sunToday = $"\u2650 Стрелец";
                ratio = Math.Round((deg - 269.25) * 1000 / 31.56) / 10;
            }
            else if (deg < 328.43)
            {
                sunToday = $"\u2651 Козерог";
                ratio = Math.Round((deg - 300.81) * 1000 / 27.62) / 10;
            }
            else if (deg < 352.1)
            {
                sunToday = $"\u2652 Водолей";
                ratio = Math.Round((deg - 328.43) * 1000 / 23.67) / 10;
            }
            else
            {
                sunToday = $"\u2653 Рыбы";
                ratio = Math.Round((deg - 352.1) * 1000 / 36.5) / 10;
            }
            return (sunToday, ratio);
        }

        public static string[] runes = {
                " \"Како\" (·А·)",
                " \"Бысть\" (·В·)",
                " \"Веды\" (·Г·)",
                " \"Гласъ\" (·Д·)",
                " \"Добро\" (·Є·)",
                " \"Жизнь\" (·S·)",
                " \"Зной\" (·Ȥ·)",
                " \"Лесъ\" (·И·)",
                " \"Миръ\" (·Ѳ·)",
                " \"Надежда\" (·І·)",
                " \"Путь\" (·АІ·)",
                " \"Рать\" (·ВІ·)",
                " \"Слово\" (·ГІ·)",
                " \"Твердо\" (·ДІ·)",
                " \"Фанъ\" (·ЄІ·)",
                " \"Хина\" (·SІ·)",
                " \"Цель\" (·ȤІ·)",
                " \"Черта\" (·ИІ·)",
                " \"Ширь\" (·ѲІ·)",
                " \"Щуръ\" (·К·)",
                " \"Пра\" (·КА·)",
                " \"Фашъ\" (·КВ·)",
                " \"Мара\" (·КГ·)",
                " \"Бха\" (·КД·)",
                " \"Міръ\" (·КЄ·)",
                " \"Вита\" (·КS·)",
                " \"Ждать\" (·КȤ·)",
                " \"Гхара\" (·КИ·)",
                " \"Джива\" (·КѲ·)",
                " \"Навь\" (·Ʌ·)",
                " \"Кха\" (·ɅА·)",
                " \"Лето\" (·ɅВ·)",
                " \"Мыслете\" (·ɅГ·)",
                " \"Нашъ\" (·ɅД·)",
                " \"Правь\" (·ɅЄ·)",
                " \"Речь\" (·ɅS·)",
                " \"Мечь\" (·ɅȤ·)",
                " \"Тархъ\" (·ɅИ·)",
                " \"Триглавъ\" (·ɅѲ·)",
                " \"Родъ\" (·М·)",
                " \"Богъ\" (·МА·)",
                " \"Чтецъ\" (·МВ·)",
                " \"Щитъ\" (·МГ·)",
                " \"Жрецъ\" (·МД·)",
                " \"Земля\" (·МЄ·)",
                " \"Явь\" (·МS·)",
                " \"Сонъ\" (·МȤ·)",
                " \"Дело\" (·МИ·)",
                " \"Беда\" (·МѲ·)",
                " \"Асъ\" (·N·)",
                " \"Есть\" (·NА·)",
                " \"Инта\" (·NВ·)",
                " \"Йога\" (·NГ·)",
                " \"Онъ\" (·NД·)",
                " \"Утеха\" (·NЄ·)",
                " \"Агни\" (·NS·)",
                " \"Инглия\" (·NȤ·)",
                " \"Эта\" (·NИ·)",
                " \"Юръ\" (·NѲ·)",
                " \"Ясень\" (·Ѯ·)",
                " \"Лань\" (·ѮА·)",
                " \"Аршъ\" (·ѮВ·)",
                " \"Ель\" (·ѮГ·)",
                " \"Ирий\" (·ѮД·)",
                " \"Истина\" (·ѮЄ·)",
                " \"Отче\" (·ѮS·)",
                " \"Устой\" (·ѮȤ·)",
                " \"Ынра\" (·ѮИ·)",
                " \"Вырий\" (·ѮѲ·)",
                " \"Рита\" (·О·)",
                " \"Уръ\" (·ОА·)",
                " \"Юга\" (·ОВ·)",
                " \"Сва\" (·ОГ·)",
                " \"Анта\" (·ОД·)",
                " \"Айна\" (·ОЄ·)",
                " \"Арисъ\" (·ОS·)",
                " \"Аусъ\" (·ОȤ·)",
                " \"Эоръ\" (·ОИ·)",
                " \"Оукъ\" (·ОѲ·)",
                " \"Аура\" (·П·)",
                " \"Вендъ\" (·ПА·)",
                " \"Гардъ\" (·ПВ·)",
                " \"Вайтмана\" (·ПГ·)",
                " \"Вайтмара\" (·ПД·)",
                " \"Рыцы\" (·ПЄ·)",
                " \"Езеръ\" (·ПS·)",
                " \"Весь\" (·ПȤ·)",
                " \"Стопа\" (·ПИ·)",
                " \"Коробъ\" (·ПѲ·)",
                " \"Звезда\" (·Ү·)",
                " \"Небо\" (·ҮА·)",
                " \"Скуфь\" (·ҮВ·)",
                " \"Ярило\" (·ҮГ·)",
                " \"Вече\" (·ҮД·)",
                " \"Месяцъ\" (·ҮЄ·)",
                " \"Фатта\" (·ҮS·)",
                " \"Леля\" (·ҮȤ·)",
                " \"Перстъ\" (·ҮИ·)",
                " \"Вежды\" (·ҮѲ·)",
                " \"Росъ\" (·Р·)",
                " \"Расъ\" (·РА·)",
                " \"Дзело\" (·РВ·)",
                " \"Четъ\" (·РГ·)",
                " \"Пядь\" (·РД·)",
                " \"Ять\" (·РЄ·)",
                " \"Шеди\" (·РS·)",
                " \"Шемя\" (·РȤ·)",
                " \"Виеть\" (·РИ·)",
                " \"Дщерь\" (·РѲ·)",
                " \"Тьма\" (·РІ·)",
                " \"Алъ\" (·РАІ·)",
                " \"Ай\" (·РВІ·)",
                " \"Тай\" (·РГІ·)",
                " \"Бэй\" (·РДІ·)",
                " \"Гэй\" (·РЄІ·)",
                " \"Дай\" (·РSІ·)",
                " \"Э\" (·РȤІ·)",
                " \"Вэй\" (·РИІ·)",
                " \"Хэй\" (·РѲІ·)",
                " \"Обь\" (·РК·)",
                " \"Го\" (·РКА·)",
                " \"Суди\" (·РКВ·)",
                " \"Ни\" (·РКГ·)",
                " \"Шта\" (·РКД·)",
                " \"Чи\" (·РКЄ·)",
                " \"Ши\" (·РКS·)",
                " \"Теремъ\" (·РКȤ·)",
                " \"Десна\" (·РКИ·)",
                " \"Одесъ\" (·РКѲ·)",
                " \"Труида\" (·РɅ·)",
                " \"Сорка\" (·РɅА·)",
                " \"Чело\" (·РɅВ·)",
                " \"Скит\" (·РɅГ·)",
                " \"Сома\" (·РɅД·)",
                " \"Донъ\" (·РɅЄ·)",
                " \"Векъ\" (·РɅS·)",
                " \"Чакра\" (·РɅȤ·)",
                " \"Вода\" (·РɅИ·)",
                " \"Уль\" (·РɅѲ·)",
                " \"Крода\" (·РМ·)",
                " \"Ита\" (·РМА·)",
                " \"Выя\" (·РМВ·)",
                " \"Дру\" (·РМГ·)",
                " \"Чадо\" (·РМД·)",
            };

        public static (string, string, double, string, string) ChertogPos(double deg)
        {

            string sunToday, zal, rune, sphere;
            double zalRatio;
            if (deg < 22.68)
            {
                sunToday = "Лисы"; sphere = "Духовная";
                if (deg < 22.68 / 9)
                {
                    zal = "1-й Зал Домоседства";
                    zalRatio = Math.Round((deg - 0 - 22.68 * 0 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[81];
                }
                else if (deg < 2 * 22.68 / 9)
                {
                    zal = "2-й Зал Служения и Воинской Доблести";
                    zalRatio = Math.Round((deg - 0 - 22.68 * 1 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[82];
                }
                else if (deg < 3 * 22.68 / 9)
                {
                    zal = "3-й Зал Созидателей";
                    zalRatio = Math.Round((deg - 0 - 22.68 * 2 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[83];
                }
                else if (deg < 4 * 22.68 / 9)
                {
                    zal = "4-й Зал Милосердия";
                    zalRatio = Math.Round((deg - 0 - 22.68 * 3 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[84];
                }
                else if (deg < 5 * 22.68 / 9)
                {
                    zal = "5-й Зал Иринации";
                    zalRatio = Math.Round((deg - 0 - 22.68 * 4 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[85];
                }
                else if (deg < 6 * 22.68 / 9)
                {
                    zal = "6-й Зал Мудрости и Смерти";
                    zalRatio = Math.Round((deg - 0 - 22.68 * 5 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[86];
                }
                else if (deg < 7 * 22.68 / 9)
                {
                    zal = "7-й Зал Вершителей Судеб";
                    zalRatio = Math.Round((deg - 0 - 22.68 * 6 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[87];
                }
                else if (deg < 8 * 22.68 / 9)
                {
                    zal = "8-й Зал Судеб";
                    zalRatio = Math.Round((deg - 0 - 22.68 * 7 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[88];
                }
                else
                {
                    zal = "9-й Зал Мудрости";
                    zalRatio = Math.Round((deg - 0 - 22.68 * 8 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[89];
                }
            }
            else if (deg < 44.37)
            {
                sunToday = "Тура"; sphere = "Земная";
				if (deg < 22.68 + 21.69 / 9)
                {
                    zal = "1-й Зал Домоседства";
                    zalRatio = Math.Round((deg - 22.68 - 21.69 * 0 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[90];
                }
                else if (deg < 22.68 + 2 * 21.69 / 9)
                {
                    zal = "2-й Зал Служения и Воинской Доблести";
                    zalRatio = Math.Round((deg - 22.68 - 21.69 * 1 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[91];
                }
                else if (deg < 22.68 + 3 * 21.69 / 9)
                {
                    zal = "3-й Зал Созидателей";
                    zalRatio = Math.Round((deg - 22.68 - 21.69 * 2 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[92];
                }
                else if (deg < 22.68 + 4 * 21.69 / 9)
                {
                    zal = "4-й Зал Милосердия";
                    zalRatio = Math.Round((deg - 22.68 - 21.69 * 3 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[93];
                }
                else if (deg < 22.68 + 5 * 21.69 / 9)
                {
                    zal = "5-й Зал Иринации";
                    zalRatio = Math.Round((deg - 22.68 - 21.69 * 4 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[94];
                }
                else if (deg < 22.68 + 6 * 21.69 / 9)
                {
                    zal = "6-й Зал Мудрости и Смерти";
                    zalRatio = Math.Round((deg - 22.68 - 21.69 * 5 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[95];
                }
                else if (deg < 22.68 + 7 * 21.69 / 9)
                {
                    zal = "7-й Зал Вершителей Судеб";
                    zalRatio = Math.Round((deg - 22.68 - 21.69 * 6 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[96];
                }
                else if (deg < 22.68 + 8 * 21.69 / 9)
                {
                    zal = "8-й Зал Судеб";
                    zalRatio = Math.Round((deg - 22.68 - 21.69 * 7 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[97];
                }
                else
                {
                    zal = "9-й Зал Мудрости";
                    zalRatio = Math.Round((deg - 22.68 - 21.69 * 8 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[98];
                }
            }
            else if (deg < 67.05)
            {
                sunToday = "Лося"; sphere = "Божественная";
				if (deg < 44.37 + 22.68 / 9)
                {
                    zal = "1-й Зал Домоседства";
                    zalRatio = Math.Round((deg - 44.37 - 22.68 * 0 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[99];
                }
                else if (deg < 44.37 + 2 * 22.68 / 9)
                {
                    zal = "2-й Зал Служения и Воинской Доблести";
                    zalRatio = Math.Round((deg - 44.37 - 22.68 * 1 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[100];
                }
                else if (deg < 44.37 + 3 * 22.68 / 9)
                {
                    zal = "3-й Зал Созидателей";
                    zalRatio = Math.Round((deg - 44.37 - 22.68 * 2 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[101];
                }
                else if (deg < 44.37 + 4 * 22.68 / 9)
                {
                    zal = "4-й Зал Милосердия";
                    zalRatio = Math.Round((deg - 44.37 - 22.68 * 3 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[102];
                }
                else if (deg < 44.37 + 5 * 22.68 / 9)
                {
                    zal = "5-й Зал Иринации";
                    zalRatio = Math.Round((deg - 44.37 - 22.68 * 4 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[103];
                }
                else if (deg < 44.37 + 6 * 22.68 / 9)
                {
                    zal = "6-й Зал Мудрости и Смерти";
                    zalRatio = Math.Round((deg - 44.37 - 22.68 * 5 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[104];
                }
                else if (deg < 44.37 + 7 * 22.68 / 9)
                {
                    zal = "7-й Зал Вершителей Судеб";
                    zalRatio = Math.Round((deg - 44.37 - 22.68 * 6 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[105];
                }
                else if (deg < 44.37 + 8 * 22.68 / 9)
                {
                    zal = "8-й Зал Судеб";
                    zalRatio = Math.Round((deg - 44.37 - 22.68 * 7 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[106];
                }
                else
                {
                    zal = "9-й Зал Мудрости";
                    zalRatio = Math.Round((deg - 44.37 - 22.68 * 8 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[107];
                }
            }
            else if (deg < 88.74)
            {
                sunToday = "Финиста"; sphere = "Душевная";
				if (deg < 67.05 + 21.69 / 9)
                {
                    zal = "1-й Зал Домоседства";
                    zalRatio = Math.Round((deg - 67.05 - 21.69 * 0 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[108];
                }
                else if (deg < 67.05 + 2 * 21.69 / 9)
                {
                    zal = "2-й Зал Служения и Воинской Доблести";
                    zalRatio = Math.Round((deg - 67.05 - 21.69 * 1 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[109];
                }
                else if (deg < 67.05 + 3 * 21.69 / 9)
                {
                    zal = "3-й Зал Созидателей";
                    zalRatio = Math.Round((deg - 67.05 - 21.69 * 2 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[110];
                }
                else if (deg < 67.05 + 4 * 21.69 / 9)
                {
                    zal = "4-й Зал Милосердия";
                    zalRatio = Math.Round((deg - 67.05 - 21.69 * 3 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[111];
                }
                else if (deg < 67.05 + 5 * 21.69 / 9)
                {
                    zal = "5-й Зал Иринации";
                    zalRatio = Math.Round((deg - 67.05 - 21.69 * 4 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[112];
                }
                else if (deg < 67.05 + 6 * 21.69 / 9)
                {
                    zal = "6-й Зал Мудрости и Смерти";
                    zalRatio = Math.Round((deg - 67.05 - 21.69 * 5 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[113];
                }
                else if (deg < 67.05 + 7 * 21.69 / 9)
                {
                    zal = "7-й Зал Вершителей Судеб";
                    zalRatio = Math.Round((deg - 67.05 - 21.69 * 6 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[114];
                }
                else if (deg < 67.05 + 8 * 21.69 / 9)
                {
                    zal = "8-й Зал Судеб";
                    zalRatio = Math.Round((deg - 67.05 - 21.69 * 7 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[115];
                }
                else
                {
                    zal = "9-й Зал Мудрости";
                    zalRatio = Math.Round((deg - 67.05 - 21.69 * 8 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[116];
                }
            }
            else if (deg < 111.42)
            {
                sunToday = "Коня"; sphere = "Духовная";
				if (deg < 88.74 + 22.68 / 9)
                {
                    zal = "1-й Зал Домоседства";
                    zalRatio = Math.Round((deg - 88.74 - 22.68 * 0 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[117];
                }
                else if (deg < 88.74 + 2 * 22.68 / 9)
                {
                    zal = "2-й Зал Служения и Воинской Доблести";
                    zalRatio = Math.Round((deg - 88.74 - 22.68 * 1 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[118];
                }
                else if (deg < 88.74 + 3 * 22.68 / 9)
                {
                    zal = "3-й Зал Созидателей";
                    zalRatio = Math.Round((deg - 88.74 - 22.68 * 2 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[119];
                }
                else if (deg < 88.74 + 4 * 22.68 / 9)
                {
                    zal = "4-й Зал Милосердия";
                    zalRatio = Math.Round((deg - 88.74 - 22.68 * 3 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[120];
                }
                else if (deg < 88.74 + 5 * 22.68 / 9)
                {
                    zal = "5-й Зал Иринации";
                    zalRatio = Math.Round((deg - 88.74 - 22.68 * 4 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[121];
                }
                else if (deg < 88.74 + 6 * 22.68 / 9)
                {
                    zal = "6-й Зал Мудрости и Смерти";
                    zalRatio = Math.Round((deg - 88.74 - 22.68 * 5 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[122];
                }
                else if (deg < 88.74 + 7 * 22.68 / 9)
                {
                    zal = "7-й Зал Вершителей Судеб";
                    zalRatio = Math.Round((deg - 88.74 - 22.68 * 6 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[123];
                }
                else if (deg < 88.74 + 8 * 22.68 / 9)
                {
                    zal = "8-й Зал Судеб";
                    zalRatio = Math.Round((deg - 88.74 - 22.68 * 7 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[124];
                }
                else
                {
                    zal = "9-й Зал Мудрости";
                    zalRatio = Math.Round((deg - 88.74 - 22.68 * 8 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[125];
                }
            }
            else if (deg < 133.11)
            {
                sunToday = "Орла"; sphere = "Земная";
				if (deg < 111.42 + 21.69 / 9)
                {
                    zal = "1-й Зал Домоседства";
                    zalRatio = Math.Round((deg - 111.42 - 21.69 * 0 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[126];
                }
                else if (deg < 111.42 + 2 * 21.69 / 9)
                {
                    zal = "2-й Зал Служения и Воинской Доблести";
                    zalRatio = Math.Round((deg - 111.42 - 21.69 * 1 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[127];
                }
                else if (deg < 111.42 + 3 * 21.69 / 9)
                {
                    zal = "3-й Зал Созидателей";
                    zalRatio = Math.Round((deg - 111.42 - 21.69 * 2 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[128];
                }
                else if (deg < 111.42 + 4 * 21.69 / 9)
                {
                    zal = "4-й Зал Милосердия";
                    zalRatio = Math.Round((deg - 111.42 - 21.69 * 3 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[129];
                }
                else if (deg < 111.42 + 5 * 21.69 / 9)
                {
                    zal = "5-й Зал Иринации";
                    zalRatio = Math.Round((deg - 111.42 - 21.69 * 4 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[130];
                }
                else if (deg < 111.42 + 6 * 21.69 / 9)
                {
                    zal = "6-й Зал Мудрости и Смерти";
                    zalRatio = Math.Round((deg - 111.42 - 21.69 * 5 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[131];
                }
                else if (deg < 111.42 + 7 * 21.69 / 9)
                {
                    zal = "7-й Зал Вершителей Судеб";
                    zalRatio = Math.Round((deg - 111.42 - 21.69 * 6 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[132];
                }
                else if (deg < 111.42 + 8 * 21.69 / 9)
                {
                    zal = "8-й Зал Судеб";
                    zalRatio = Math.Round((deg - 111.42 - 21.69 * 7 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[133];
                }
                else
                {
                    zal = "9-й Зал Мудрости";
                    zalRatio = Math.Round((deg - 111.42 - 21.69 * 8 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[134];
                }
            }
            else if (deg < 155.79)
            {
                sunToday = "Раса"; sphere = "Божественная";
				if (deg < 133.11 + 22.68 / 9)
                {
                    zal = "1-й Зал Домоседства";
                    zalRatio = Math.Round((deg - 133.11 - 22.68 * 0 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[135];
                }
                else if (deg < 133.11 + 2 * 22.68 / 9)
                {
                    zal = "2-й Зал Служения и Воинской Доблести";
                    zalRatio = Math.Round((deg - 133.11 - 22.68 * 1 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[136];
                }
                else if (deg < 133.11 + 3 * 22.68 / 9)
                {
                    zal = "3-й Зал Созидателей";
                    zalRatio = Math.Round((deg - 133.11 - 22.68 * 2 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[137];
                }
                else if (deg < 133.11 + 4 * 22.68 / 9)
                {
                    zal = "4-й Зал Милосердия";
                    zalRatio = Math.Round((deg - 133.11 - 22.68 * 3 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[138];
                }
                else if (deg < 133.11 + 5 * 22.68 / 9)
                {
                    zal = "5-й Зал Иринации";
                    zalRatio = Math.Round((deg - 133.11 - 22.68 * 4 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[139];
                }
                else if (deg < 133.11 + 6 * 22.68 / 9)
                {
                    zal = "6-й Зал Мудрости и Смерти";
                    zalRatio = Math.Round((deg - 133.11 - 22.68 * 5 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[140];
                }
                else if (deg < 133.11 + 7 * 22.68 / 9)
                {
                    zal = "7-й Зал Вершителей Судеб";
                    zalRatio = Math.Round((deg - 133.11 - 22.68 * 6 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[141];
                }
                else if (deg < 133.11 + 8 * 22.68 / 9)
                {
                    zal = "8-й Зал Судеб";
                    zalRatio = Math.Round((deg - 133.11 - 22.68 * 7 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[142];
                }
                else
                {
                    zal = "9-й Зал Мудрости";
                    zalRatio = Math.Round((deg - 133.11 - 22.68 * 8 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[143];
                }
            }
            else if (deg < 179.46)
            {
                sunToday = "Девы"; sphere = "Душевная";
				if (deg < 155.79 + 23.67 / 9)
                {
                    zal = "1-й Зал Домоседства";
                    zalRatio = Math.Round((deg - 155.79 - 23.67 * 0 / 9) * 1000 / (23.67 / 9)) / 10;
                    rune = runes[0];
                }
                else if (deg < 155.79 + 2 * 23.67 / 9)
                {
                    zal = "2-й Зал Служения и Воинской Доблести";
                    zalRatio = Math.Round((deg - 155.79 - 23.67 * 1 / 9) * 1000 / (23.67 / 9)) / 10;
                    rune = runes[1];
                }
                else if (deg < 155.79 + 3 * 23.67 / 9)
                {
                    zal = "3-й Зал Созидателей";
                    zalRatio = Math.Round((deg - 155.79 - 23.67 * 2 / 9) * 1000 / (23.67 / 9)) / 10;
                    rune = runes[2];
                }
                else if (deg < 155.79 + 4 * 23.67 / 9)
                {
                    zal = "4-й Зал Милосердия";
                    zalRatio = Math.Round((deg - 155.79 - 23.67 * 3 / 9) * 1000 / (23.67 / 9)) / 10;
                    rune = runes[3];
                }
                else if (deg < 155.79 + 5 * 23.67 / 9)
                {
                    zal = "5-й Зал Иринации";
                    zalRatio = Math.Round((deg - 155.79 - 23.67 * 4 / 9) * 1000 / (23.67 / 9)) / 10;
                    rune = runes[4];
                }
                else if (deg < 155.79 + 6 * 23.67 / 9)
                {
                    zal = "6-й Зал Мудрости и Смерти";
                    zalRatio = Math.Round((deg - 155.79 - 23.67 * 5 / 9) * 1000 / (23.67 / 9)) / 10;
                    rune = runes[5];
                }
                else if (deg < 155.79 + 7 * 23.67 / 9)
                {
                    zal = "7-й Зал Вершителей Судеб";
                    zalRatio = Math.Round((deg - 155.79 - 23.67 * 6 / 9) * 1000 / (23.67 / 9)) / 10;
                    rune = runes[6];
                }
                else if (deg < 155.79 + 8 * 23.67 / 9)
                {
                    zal = "8-й Зал Судеб";
                    zalRatio = Math.Round((deg - 155.79 - 23.67 * 7 / 9) * 1000 / (23.67 / 9)) / 10;
                    rune = runes[7];
                }
                else
                {
                    zal = "9-й Зал Мудрости";
                    zalRatio = Math.Round((deg - 155.79 - 23.67 * 8 / 9) * 1000 / (23.67 / 9)) / 10;
                    rune = runes[8];
                }
            }
            else if (deg < 200.17)
            {
                sunToday = "Вепря"; sphere = "Духовная";
				if (deg < 179.46 + 20.71 / 9)
                {
                    zal = "1-й Зал Домоседства";
                    zalRatio = Math.Round((deg - 179.46 - 20.71 * 0 / 9) * 1000 / (20.71 / 9)) / 10;
                    rune = runes[9];
                }
                else if (deg < 179.46 + 2 * 20.71 / 9)
                {
                    zal = "2-й Зал Служения и Воинской Доблести";
                    zalRatio = Math.Round((deg - 179.46 - 20.71 * 1 / 9) * 1000 / (20.71 / 9)) / 10;
                    rune = runes[10];
                }
                else if (deg < 179.46 + 3 * 20.71 / 9)
                {
                    zal = "3-й Зал Созидателей";
                    zalRatio = Math.Round((deg - 179.46 - 20.71 * 2 / 9) * 1000 / (20.71 / 9)) / 10;
                    rune = runes[11];
                }
                else if (deg < 179.46 + 4 * 20.71 / 9)
                {
                    zal = "4-й Зал Милосердия";
                    zalRatio = Math.Round((deg - 179.46 - 20.71 * 3 / 9) * 1000 / (20.71 / 9)) / 10;
                    rune = runes[12];
                }
                else if (deg < 179.46 + 5 * 20.71 / 9)
                {
                    zal = "5-й Зал Иринации";
                    zalRatio = Math.Round((deg - 179.46 - 20.71 * 4 / 9) * 1000 / (20.71 / 9)) / 10;
                    rune = runes[13];
                }
                else if (deg < 179.46 + 6 * 20.71 / 9)
                {
                    zal = "6-й Зал Мудрости и Смерти";
                    zalRatio = Math.Round((deg - 179.46 - 20.71 * 5 / 9) * 1000 / (20.71 / 9)) / 10;
                    rune = runes[14];
                }
                else if (deg < 179.46 + 7 * 20.71 / 9)
                {
                    zal = "7-й Зал Вершителей Судеб";
                    zalRatio = Math.Round((deg - 179.46 - 20.71 * 6 / 9) * 1000 / (20.71 / 9)) / 10;
                    rune = runes[15];
                }
                else if (deg < 179.46 + 8 * 20.71 / 9)
                {
                    zal = "8-й Зал Судеб";
                    zalRatio = Math.Round((deg - 179.46 - 20.71 * 7 / 9) * 1000 / (20.71 / 9)) / 10;
                    rune = runes[16];
                }
                else
                {
                    zal = "9-й Зал Мудрости";
                    zalRatio = Math.Round((deg - 179.46 - 20.71 * 8 / 9) * 1000 / (20.71 / 9)) / 10;
                    rune = runes[17];
                }
            }
            else if (deg < 222.85)
            {
                sunToday = "Щуки"; sphere = "Земная";
				if (deg < 200.17 + 22.68 / 9)
                {
                    zal = "1-й Зал Домоседства";
                    zalRatio = Math.Round((deg - 200.17 - 22.68 * 0 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[18];
                }
                else if (deg < 200.17 + 2 * 22.68 / 9)
                {
                    zal = "2-й Зал Служения и Воинской Доблести";
                    zalRatio = Math.Round((deg - 200.17 - 22.68 * 1 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[19];
                }
                else if (deg < 200.17 + 3 * 22.68 / 9)
                {
                    zal = "3-й Зал Созидателей";
                    zalRatio = Math.Round((deg - 200.17 - 22.68 * 2 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[20];
                }
                else if (deg < 200.17 + 4 * 22.68 / 9)
                {
                    zal = "4-й Зал Милосердия";
                    zalRatio = Math.Round((deg - 200.17 - 22.68 * 3 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[21];
                }
                else if (deg < 200.17 + 5 * 22.68 / 9)
                {
                    zal = "5-й Зал Иринации";
                    zalRatio = Math.Round((deg - 200.17 - 22.68 * 4 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[22];
                }
                else if (deg < 200.17 + 6 * 22.68 / 9)
                {
                    zal = "6-й Зал Мудрости и Смерти";
                    zalRatio = Math.Round((deg - 200.17 - 22.68 * 5 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[23];
                }
                else if (deg < 200.17 + 7 * 22.68 / 9)
                {
                    zal = "7-й Зал Вершителей Судеб";
                    zalRatio = Math.Round((deg - 200.17 - 22.68 * 6 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[24];
                }
                else if (deg < 200.17 + 8 * 22.68 / 9)
                {
                    zal = "8-й Зал Судеб";
                    zalRatio = Math.Round((deg - 200.17 - 22.68 * 7 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[25];
                }
                else
                {
                    zal = "9-й Зал Мудрости";
                    zalRatio = Math.Round((deg - 200.17 - 22.68 * 8 / 9) * 1000 / (22.68 / 9)) / 10;
                    rune = runes[26];
                }
            }
            else if (deg < 243.56)
            {
                sunToday = "Лебедя"; sphere = "Божественная";
				if (deg < 222.85 + 20.71 / 9)
                {
                    zal = "1-й Зал Домоседства";
                    zalRatio = Math.Round((deg - 222.85 - 20.71 * 0 / 9) * 1000 / (20.71 / 9)) / 10;
                    rune = runes[27];
                }
                else if (deg < 222.85 + 2 * 20.71 / 9)
                {
                    zal = "2-й Зал Служения и Воинской Доблести";
                    zalRatio = Math.Round((deg - 222.85 - 20.71 * 1 / 9) * 1000 / (20.71 / 9)) / 10;
                    rune = runes[28];
                }
                else if (deg < 222.85 + 3 * 20.71 / 9)
                {
                    zal = "3-й Зал Созидателей";
                    zalRatio = Math.Round((deg - 222.85 - 20.71 * 2 / 9) * 1000 / (20.71 / 9)) / 10;
                    rune = runes[29];
                }
                else if (deg < 222.85 + 4 * 20.71 / 9)
                {
                    zal = "4-й Зал Милосердия";
                    zalRatio = Math.Round((deg - 222.85 - 20.71 * 3 / 9) * 1000 / (20.71 / 9)) / 10;
                    rune = runes[30];
                }
                else if (deg < 222.85 + 5 * 20.71 / 9)
                {
                    zal = "5-й Зал Иринации";
                    zalRatio = Math.Round((deg - 222.85 - 20.71 * 4 / 9) * 1000 / (20.71 / 9)) / 10;
                    rune = runes[31];
                }
                else if (deg < 222.85 + 6 * 20.71 / 9)
                {
                    zal = "6-й Зал Мудрости и Смерти";
                    zalRatio = Math.Round((deg - 222.85 - 20.71 * 5 / 9) * 1000 / (20.71 / 9)) / 10;
                    rune = runes[32];
                }
                else if (deg < 222.85 + 7 * 20.71 / 9)
                {
                    zal = "7-й Зал Вершителей Судеб";
                    zalRatio = Math.Round((deg - 222.85 - 20.71 * 6 / 9) * 1000 / (20.71 / 9)) / 10;
                    rune = runes[33];
                }
                else if (deg < 222.85 + 8 * 20.71 / 9)
                {
                    zal = "8-й Зал Судеб";
                    zalRatio = Math.Round((deg - 222.85 - 20.71 * 7 / 9) * 1000 / (20.71 / 9)) / 10;
                    rune = runes[34];
                }
                else
                {
                    zal = "9-й Зал Мудрости";
                    zalRatio = Math.Round((deg - 222.85 - 20.71 * 8 / 9) * 1000 / (20.71 / 9)) / 10;
                    rune = runes[35];
                }
            }
            else if (deg < 265.25)
            {
                sunToday = "Змия"; sphere = "Душевная";
				if (deg < 243.56 + 21.69 / 9)
                {
                    zal = "1-й Зал Домоседства";
                    zalRatio = Math.Round((deg - 243.56 - 21.69 * 0 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[36];
                }
                else if (deg < 243.56 + 2 * 21.69 / 9)
                {
                    zal = "2-й Зал Служения и Воинской Доблести";
                    zalRatio = Math.Round((deg - 243.56 - 21.69 * 1 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[37];
                }
                else if (deg < 243.56 + 3 * 21.69 / 9)
                {
                    zal = "3-й Зал Созидателей";
                    zalRatio = Math.Round((deg - 243.56 - 21.69 * 2 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[38];
                }
                else if (deg < 243.56 + 4 * 21.69 / 9)
                {
                    zal = "4-й Зал Милосердия";
                    zalRatio = Math.Round((deg - 243.56 - 21.69 * 3 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[39];
                }
                else if (deg < 243.56 + 5 * 21.69 / 9)
                {
                    zal = "5-й Зал Иринации";
                    zalRatio = Math.Round((deg - 243.56 - 21.69 * 4 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[40];
                }
                else if (deg < 243.56 + 6 * 21.69 / 9)
                {
                    zal = "6-й Зал Мудрости и Смерти";
                    zalRatio = Math.Round((deg - 243.56 - 21.69 * 5 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[41];
                }
                else if (deg < 243.56 + 7 * 21.69 / 9)
                {
                    zal = "7-й Зал Вершителей Судеб";
                    zalRatio = Math.Round((deg - 243.56 - 21.69 * 6 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[42];
                }
                else if (deg < 243.56 + 8 * 21.69 / 9)
                {
                    zal = "8-й Зал Судеб";
                    zalRatio = Math.Round((deg - 243.56 - 21.69 * 7 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[43];
                }
                else
                {
                    zal = "9-й Зал Мудрости";
                    zalRatio = Math.Round((deg - 243.56 - 21.69 * 8 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[44];
                }
            }
            else if (deg < 286.94)
            {
                sunToday = "Ворона"; sphere = "Духовная";
				if (deg < 265.25 + 21.69 / 9)
                {
                    zal = "1-й Зал Домоседства";
                    zalRatio = Math.Round((deg - 265.25 - 21.69 * 0 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[45];
                }
                else if (deg < 265.25 + 2 * 21.69 / 9)
                {
                    zal = "2-й Зал Служения и Воинской Доблести";
                    zalRatio = Math.Round((deg - 265.25 - 21.69 * 1 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[46];
                }
                else if (deg < 265.25 + 3 * 21.69 / 9)
                {
                    zal = "3-й Зал Созидателей";
                    zalRatio = Math.Round((deg - 265.25 - 21.69 * 2 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[47];
                }
                else if (deg < 265.25 + 4 * 21.69 / 9)
                {
                    zal = "4-й Зал Милосердия";
                    zalRatio = Math.Round((deg - 265.25 - 21.69 * 3 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[48];
                }
                else if (deg < 265.25 + 5 * 21.69 / 9)
                {
                    zal = "5-й Зал Иринации";
                    zalRatio = Math.Round((deg - 265.25 - 21.69 * 4 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[49];
                }
                else if (deg < 265.25 + 6 * 21.69 / 9)
                {
                    zal = "6-й Зал Мудрости и Смерти";
                    zalRatio = Math.Round((deg - 265.25 - 21.69 * 5 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[50];
                }
                else if (deg < 265.25 + 7 * 21.69 / 9)
                {
                    zal = "7-й Зал Вершителей Судеб";
                    zalRatio = Math.Round((deg - 265.25 - 21.69 * 6 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[51];
                }
                else if (deg < 265.25 + 8 * 21.69 / 9)
                {
                    zal = "8-й Зал Судеб";
                    zalRatio = Math.Round((deg - 265.25 - 21.69 * 7 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[52];
                }
                else
                {
                    zal = "9-й Зал Мудрости";
                    zalRatio = Math.Round((deg - 265.25 - 21.69 * 8 / 9) * 1000 / (21.69 / 9)) / 10;
                    rune = runes[53];
                }
            }
            else if (deg < 310.61)
            {
                sunToday = "Медведя"; sphere = "Земная";
				if (deg < 286.94 + 23.67 / 9)
                {
                    zal = "1-й Зал Домоседства";
                    zalRatio = Math.Round((deg - 286.94 - 23.67 * 0 / 9) * 1000 / (23.67 / 9)) / 10;
                    rune = runes[54];
                }
                else if (deg < 286.94 + 2 * 23.67 / 9)
                {
                    zal = "2-й Зал Служения и Воинской Доблести";
                    zalRatio = Math.Round((deg - 286.94 - 23.67 * 1 / 9) * 1000 / (23.67 / 9)) / 10;
                    rune = runes[55];
                }
                else if (deg < 286.94 + 3 * 23.67 / 9)
                {
                    zal = "3-й Зал Созидателей";
                    zalRatio = Math.Round((deg - 286.94 - 23.67 * 2 / 9) * 1000 / (23.67 / 9)) / 10;
                    rune = runes[56];
                }
                else if (deg < 286.94 + 4 * 23.67 / 9)
                {
                    zal = "4-й Зал Милосердия";
                    zalRatio = Math.Round((deg - 286.94 - 23.67 * 3 / 9) * 1000 / (23.67 / 9)) / 10;
                    rune = runes[57];
                }
                else if (deg < 286.94 + 5 * 23.67 / 9)
                {
                    zal = "5-й Зал Иринации";
                    zalRatio = Math.Round((deg - 286.94 - 23.67 * 4 / 9) * 1000 / (23.67 / 9)) / 10;
                    rune = runes[58];
                }
                else if (deg < 286.94 + 6 * 23.67 / 9)
                {
                    zal = "6-й Зал Мудрости и Смерти";
                    zalRatio = Math.Round((deg - 286.94 - 23.67 * 5 / 9) * 1000 / (23.67 / 9)) / 10;
                    rune = runes[59];
                }
                else if (deg < 286.94 + 7 * 23.67 / 9)
                {
                    zal = "7-й Зал Вершителей Судеб";
                    zalRatio = Math.Round((deg - 286.94 - 23.67 * 6 / 9) * 1000 / (23.67 / 9)) / 10;
                    rune = runes[60];
                }
                else if (deg < 286.94 + 8 * 23.67 / 9)
                {
                    zal = "8-й Зал Судеб";
                    zalRatio = Math.Round((deg - 286.94 - 23.67 * 7 / 9) * 1000 / (23.67 / 9)) / 10;
                    rune = runes[61];
                }
                else
                {
                    zal = "9-й Зал Мудрости";
                    zalRatio = Math.Round((deg - 286.94 - 23.67 * 8 / 9) * 1000 / (23.67 / 9)) / 10;
                    rune = runes[62];
                }
            }
            else if (deg < 335.305)
            {
                sunToday = "Бусла"; sphere = "Божественная";
				if (deg < 310.61 + 24.695 / 9)
                {
                    zal = "1-й Зал Домоседства";
                    zalRatio = Math.Round((deg - 310.61 - 24.695 * 0 / 9) * 1000 / (24.695 / 9)) / 10;
                    rune = runes[63];
                }
                else if (deg < 310.61 + 2 * 24.695 / 9)
                {
                    zal = "2-й Зал Служения и Воинской Доблести";
                    zalRatio = Math.Round((deg - 310.61 - 24.695 * 1 / 9) * 1000 / (24.695 / 9)) / 10;
                    rune = runes[64];
                }
                else if (deg < 310.61 + 3 * 24.695 / 9)
                {
                    zal = "3-й Зал Созидателей";
                    zalRatio = Math.Round((deg - 310.61 - 24.695 * 2 / 9) * 1000 / (24.695 / 9)) / 10;
                    rune = runes[65];
                }
                else if (deg < 310.61 + 4 * 24.695 / 9)
                {
                    zal = "4-й Зал Милосердия";
                    zalRatio = Math.Round((deg - 310.61 - 24.695 * 3 / 9) * 1000 / (24.695 / 9)) / 10;
                    rune = runes[66];
                }
                else if (deg < 310.61 + 5 * 24.695 / 9)
                {
                    zal = "5-й Зал Иринации";
                    zalRatio = Math.Round((deg - 310.61 - 24.695 * 4 / 9) * 1000 / (24.695 / 9)) / 10;
                    rune = runes[67];
                }
                else if (deg < 310.61 + 6 * 24.695 / 9)
                {
                    zal = "6-й Зал Мудрости и Смерти";
                    zalRatio = Math.Round((deg - 310.61 - 24.695 * 5 / 9) * 1000 / (24.695 / 9)) / 10;
                    rune = runes[68];
                }
                else if (deg < 310.61 + 7 * 24.695 / 9)
                {
                    zal = "7-й Зал Вершителей Судеб";
                    zalRatio = Math.Round((deg - 310.61 - 24.695 * 6 / 9) * 1000 / (24.695 / 9)) / 10;
                    rune = runes[69];
                }
                else if (deg < 310.61 + 8 * 24.695 / 9)
                {
                    zal = "8-й Зал Судеб";
                    zalRatio = Math.Round((deg - 310.61 - 24.695 * 7 / 9) * 1000 / (24.695 / 9)) / 10;
                    rune = runes[70];
                }
                else
                {
                    zal = "9-й Зал Мудрости";
                    zalRatio = Math.Round((deg - 310.61 - 24.695 * 8 / 9) * 1000 / (24.695 / 9)) / 10;
                    rune = runes[71];
                }
            }
            else
            {
                sunToday = "Волка"; sphere = "Душевная";
				if (deg < 335.305 + 24.695 / 9)
                {
                    zal = "1-й Зал Домоседства";
                    zalRatio = Math.Round((deg - 335.305 - 24.695 * 0 / 9) * 1000 / (24.695 / 9)) / 10;
                    rune = runes[72];
                }
                else if (deg < 335.305 + 2 * 24.695 / 9)
                {
                    zal = "2-й Зал Служения и Воинской Доблести";
                    zalRatio = Math.Round((deg - 335.305 - 24.695 * 1 / 9) * 1000 / (24.695 / 9)) / 10;
                    rune = runes[73];
                }
                else if (deg < 335.305 + 3 * 24.695 / 9)
                {
                    zal = "3-й Зал Созидателей";
                    zalRatio = Math.Round((deg - 335.305 - 24.695 * 2 / 9) * 1000 / (24.695 / 9)) / 10;
                    rune = runes[74];
                }
                else if (deg < 335.305 + 4 * 24.695 / 9)
                {
                    zal = "4-й Зал Милосердия";
                    zalRatio = Math.Round((deg - 335.305 - 24.695 * 3 / 9) * 1000 / (24.695 / 9)) / 10;
                    rune = runes[75];
                }
                else if (deg < 335.305 + 5 * 24.695 / 9)
                {
                    zal = "5-й Зал Иринации";
                    zalRatio = Math.Round((deg - 335.305 - 24.695 * 4 / 9) * 1000 / (24.695 / 9)) / 10;
                    rune = runes[76];
                }
                else if (deg < 335.305 + 6 * 24.695 / 9)
                {
                    zal = "6-й Зал Мудрости и Смерти";
                    zalRatio = Math.Round((deg - 335.305 - 24.695 * 5 / 9) * 1000 / (24.695 / 9)) / 10;
                    rune = runes[77];
                }
                else if (deg < 335.305 + 7 * 24.695 / 9)
                {
                    zal = "7-й Зал Вершителей Судеб";
                    zalRatio = Math.Round((deg - 335.305 - 24.695 * 6 / 9) * 1000 / (24.695 / 9)) / 10;
                    rune = runes[78];
                }
                else if (deg < 335.305 + 8 * 24.695 / 9)
                {
                    zal = "8-й Зал Судеб";
                    zalRatio = Math.Round((deg - 335.305 - 24.695 * 7 / 9) * 1000 / (24.695 / 9)) / 10;
                    rune = runes[79];
                }
                else
                {
                    zal = "9-й Зал Мудрости";
                    zalRatio = Math.Round((deg - 335.305 - 24.695 * 8 / 9) * 1000 / (24.695 / 9)) / 10;
                    rune = runes[80];
                }
            }
            return (sunToday, zal, zalRatio, rune, sphere);
        }
    }
}
